{
  "version": 1,
  "exportedAt": 1771182490026,
  "title": "Teknik Restrukturisasi Kognitif untuk Mereduksi Kecemasan Sosial Remaja",
  "parsedDocument": {
    "id": "03f331f8-e4c9-4bca-986c-74df6c2bafbd",
    "fileName": "TEKNIK RESTRUKTURISASI KOGNITIF UNTUK MEREDUKSI.pdf",
    "mimeType": "application/pdf",
    "sourceType": "pdf",
    "text": "Jurnal Bimbingan dan Konseling Borneo,   2(1) 2020 , 86 - 92  http://ojs.borneo.ac.id/ojs/index.php/JBKB  ISSN 2685 - 0753 (cetak)   ISSN 2685 - 2039 ( online )  TEKNIK RESTRUKTURISASI KOGNITIF UNTUK MEREDUKSI  KECEMASAN SOSIAL REMAJA  Novita Riyanti  Email: novitariyanti11@gmail.com  Abstrak  Salah satu tugas perkembangan masa remaja adalah mencapai hubungan baru  yang lebih matang baik antar   individu ataupun kelompok. Salah satu kesulitan yang  dialami remaja adalah yang berhubungan dengan penyesuaian sosial. Ketika remaja  tidak dapat menempatkan diri dengan baik dilingkungan sosial, maka akan berdampak  negatif bagi dirinya dan lingkungan sekit arnya pun dianggap negatif, ketika tanggapan  negatif tersebut terus dipertahankan, maka akan menimbulkan kecemasan sosial pada  remaja. Beberapa literatur menunjukkan bahwa salah satu teknik yang dapat membantu  remaja mengurangi kecemasan sosial yaitu tekni k restrukturisasi kognitif. Kajian ini  membahas tentang kecemasan sosial, aspek - aspek kecemasan sosial, faktor penyebab  kecemasan sosial, teknik restrukturisasi kognitif, tujuan teknik restrukturisasi kognitif  dan implementasi teknik restrukturiasai kognit if untuk mereduksi kecemasan sosial  remaja.   Hasil   kajian   menunjukkan   bahwa   teknik   restrukturisasi   kognitif   dapat  membantu   mengkoreksi   kepercayaan   yang   salah   atau   menyimpang   yang  mengakibatkan remaja berfikir tidak rasional dan menggantinya dengan cara berf ikir  yang lebih rasional.  Kata Kunci   : kecemasan sosial; teknik restrukturisasi kognitif; remaja  PENDAHULUAN  Masa remaja merupakan tahap  perkembangan antara masa anak - anak  dan masa dewasa yang ditandai oleh  perubahan   fisik   umum   serta  perkembangan   kognitif   dan  sosial (Hurlock 2004, hlm. 206).  Berkaitan dengan perkembangan  remaja, perlu disadari bahwa proses  perkembangan itu terjadi melalui  pengalaman belajar. Salah satu tugas  perkembangan pada masa remaja yaitu  memiliki kesadaran tanggungjawab  sosial. Tidak seperti masa kanak - kanak,  pada masa remaja perkembangan sosial  nya semakin luas. Pada masa remaja,  mere ka tidak hanya berteman dengan  lingkungan sekitar, tetapi mereka  memiliki keinginan untuk mencari  teman dilingkungan yang lebih luas.  Perkembangan   sosial  mempengaruhi remaja dalam hubungan  sosialnya, seperti dengan teman sebaya,  lingkungan dan orang tua. Kehidupan  sosial   pada   usia   remaja   mulai  menunjukkan   ketertarikan   untuk  bergabung   dengan   lingkungan   sosial  serta menurut Herbert, T.B (2001, hlm  39)   pada masa remaja menjadi tahap  perkembangan   identitas   yang   penting  86\n\n87  dan pengembangan keterampilan sosial,  dimana   kekhawatiran   tentang  penerimaan   teman   menjadi   hal   yang  paling penting. Ketika memasuki masa  remaja, salah satu kesulitan yang dialami  remaja ada lah yang berhubungan dengan  penyesuaian sosial (Hurlock 2002, hlm.  213).   Remaja   dituntut   harus  menyesuaikan diri dengan lingkungan,  terutama   lingkungan   sekolah   dan  lingkungan teman sebaya. Pada masa  remaja   cenderung   untuk   mengikuti  pendapat   orang   lain,   nil ai,   kebiasaan  serta keinginan orang lain, hal ini dapat  memberikan   dampak   yang   positif  maupun negatif bagi remaja. Apabila  remaja dapat menempatkan diri dengan  baik   di   tengah - tengah   realita,   maka  remaja   dapat   menghadapi   kenyataan  kehidupan   dengan   penuh   keb enaran,  tetapi   apabila   remaja   tidak   dapat  menerima   realita   yang   terjadi  dikehidupannya, maka akan berdampak  negatif   bagi   dirinya   dan   lingkungan  sekitarnya   pun   dianggap   negatif   bagi  dirinya.  Menurut Sriarti (2008, hlm. 34)  tanggapan   negatif   dapat   menjadik an  remaja hidup dalam ketakutan yang akan  mempengaruhi   seluruh   alam  perasaannya   sehingga   terjadi  keguncangan   dalam   keseimbangan  kepribadian, yaitu suatu keadaan emosi  yang labil. Maka dalam keadaan labil  remaja tidak dapat berpikir secara wajar  dan segala   sesuatu yang berada di dalam  dan   di   luar   diri   dipersepsikan   secara  salah.   Keadaan   labil   yang   dialami  remaja   semakin   lama   tidak   dapat  dipertahankan lagi, yang akhirnya akan  menimbulkan kecemasan sosial.  Di   Indonesia,   hasil   penelitian  Suryaningrum   (2006)   di   Universitas  Muhammadiyah Malang menunjukkan  dari 211 partisipan mahasiswa 22,27%  mengalami gangguan kecemasan sosial  21,28% sangat membutuhkan bantuan,  20,85% terindikasi memunculkan gejala  gangguan,   56,87%   tidak   dapat  didagnosis   mengalami   gangguan  kecema san   sosial.   Selain   itu   hasil  Penelitian Beidel & Morris 1995 (dalam  Bukowski,   H.   M   1997,   p.   338)  menemukan   bahwa   anak - anak   yang  didiagnosis   dengan   kecemasan   sosial  melaporkan bahwa 60% situasi sosial  mereka   yang   menyedihkan   terjadi   di  lingkungan   sekolah   de ngan   kejadian  yang   paling   menyedihkan   adalah  pertemanan dengan teman sebaya yang  tidak baik atau tidak akrab. Dengan kata  lain bahwa kecemasan sosial yang sering  terjadi   yaitu   dilingkungan   sekolah  bersama dengan teman - teman.  Remaja   yang   mengalami  kecemas an   sosial   biasanya   memiliki  cara   berfikir   yang   irasional   terhadap  dirinya sendiri dan orang lain. Remaja  berfikir   ketika   dia   mengatakan   dan  melakukan suatu tindakan akan dinilai  negatif oleh orang lain, ketika pemikiran  tersebut muncul, maka akibatnya rema ja  akan semakin menjauhi interaksi sosial  dengan orang lain.  Berdasarkan uraian di atas, perlu  adanya   solusi   untuk   membantu  memperbaiki   fungsi   berfikir   remaja  yang   irasional   menjadi   lebih   rasional  agar tidak terjadi gangguan psikologis  pada   remaja.   Upaya   tersebut   dapat  dilakukan melalui teknik restrukturisasi  kognitif,   yang   bertujuan   untuk  mengubah atau mengganti pikiran yang  irasional menjadi pikiran yang rasional.  Sejalan   dengan   penelitian   yang  dilakukan   oleh   Anggia,   M.I   (2018)  menyatakan   bahwa   ketika   siswa  diberikan layanan konseling kelompok  dengan teknik restrukturisasi kognitif,  maka   kecemasan   siswa   dalam  menghadapi ujian semakin menurun.  Atas   dasar   tersebut,   perlu  pemikiran lebih lanjut yaitu :\n\n88  “bagaimana   mengimplementasikan  teknik restrukturisas i kognitif”. Konsep  tersebut   bertujuan   untuk   membantu  mengatasi   kesalahan   fungsi   berfikir  remaja   terhadap   sesuatu   yang   akan  berpengaruh   terhadap   perilaku   yang  akan ditunjukkan oleh remaja.  METODE  Tulisan   ini   bersifat   library  research   (penelitian/stud i   pustaka),  dengan   mengumpulkan   data   dan  informasi   berdasarkan   kajian   ilmiah  dalam buku, hasil penelitian, dan jurnal  ilmiah. Output dari artikel ini adalah  memberikan   konstribusi   pemikiran  mengenai   teknik   restrukturisasi  kognitif untuk mereduksi kecemasan  sosial remaja.  PEMBAHASAN   Kecemasan Sosial  Kecemasan   sosial   adalah  seseorang yang mengalami ketakutan,  rasa   gugup,   dan   kekhawatiran   yang  dirasakan   saat   melakukan   interaksi  sosial dengan orang lain. Kecemasan  sosial   “menyerang”   fikiran   i ndividu,  contohnya   jika   remaja   melakukan  sesuatu, remaja itu akan diberi label  negatif oleh orang lain atau berpikir  dirinya akan melakukan sesuatu yang  dapat membuat dirinya malu dihadapan  orang lain (Butler, G. 2008, hlm. 1).  American Psychiatric Associ ation  (APA)   mengungkapkan   bahwa  kecemasan   sosial   adalah   ketakutan  yang menetap terhadap satu (atau lebih)  situasi   sosial   yang   terkait   dan  berhubungan dengan performa, yang  membuat   individu   harus   berhadapan  dengan   orang - orang   yang   tidak  dikenalnya   atau   me nghadapi  kemungkinan diamati oleh orang lain,  takut bahwa dirinya akan dipermalukan  atau dihina (La Greca, 1998). Menurut  Arkowitz   (1975,   hlm.   211 - 221)  masalah   yang   sering   dialami   oleh  individu dengan gangguan kecemasan  sosial adalah merasa tidak nyaman sa at  melakukan interaksi sosial.  Cederlund (2013) mengungkapkan  bahwa   17%   remaja   yang   memiliki  ketakutan   sosial   sering   menghindari  situasi sosial. Menurut Philippe et al  (2013,   hlm.   301)   hal   ini   dapat  menyebabkan   rusaknya   fungsi   sosial,  pendidikan, dan peke rjaan. Bhan, K. P.  et al (2009, hlm. 393) juga berpendapat  bahwa gangguan kecemasan sosial dapat  melumpuhkan   individu   dengan  kemungkinan   terjadi   pengangguran,  terhambatnya sosialisasi seseorang, dan  ketidakpuasan terhadap kehidupan serta  kesehatan.  Di   kan ada   yang   mengalami  gangguan kecemasan sosial pertahunnya  diperkirakan sebesar 8%, sedangkan di  provinsi   Nova   Scotia   mengalami  gangguan kecemasan sosial pertahunnya  diperkirakan 4,2% (Bhan, K. P. et al.,  2009, hlm. 394).  Orang - orang   yang   memiliki  kecemasan   sosial cenderung dianggap  tidak menarik oleh orang lain, kurang  kredibel, dan sangat jarang menduduki  jabatan   pemimpin.   Dampak   yang  ditimbulkan pada pekerjaan seseorang  akan   menjadi   tidak   puas   akan   hasil  kerjanya, disekolah individu cenderung  malas, baik   malas dalam belajar ataupun  berinteraksi   dengan   orang   lain  (Rakhmat, 2011, hlm.   107). Menurut  penelitian   yang   dilakukan,   gangguan  kecemasan sosial tidak begitu mendapat  perhatian   khusus   karena   gangguan  tersebut masih dianggap wajar, kecuali  gangguan   terseb ut   berlanjut   dimana  siswa menolak untuk sekolah (beidel &  morris, 1995).  Dapat   disimpulkan   bahwa  kecemasan   sosial   adalah\n\n89  ketakutan/kekhawatiran   untuk  berinteraksi dengan orang lain yang  disebabkan   karena   individu   tersebut  beranggapan   bahwa   ia   akan  mendap atkan kritikan dan hinaan dari  orang   lain,   yang   mengakibatkan  seseorang tersebut menjadi pemurung,  pendiam,   dan   tidak   ada   keberanian  untuk   berbicara   didepan   umum.  Aspek - Aspek Kecemasan Sosial  Ada tiga asek kecemasan sosial  menurut (La Greca,   1998, hlm. 88 )  yaitu:   (1)   ketakutan   akan   evaluasi  negatif.   Individu   yang   mengalami  gangguan kecemasan sosial akan takut  terhadap penilaian negatif dari orang  lain   dan   lingkungan   sekitarnya,   dan  individu   yang   mengalami   gangguan  kecemasan   sosial   juga   akan   menilai  dirinya   dengan penilaian yang negatif  apabila   harapan   yang   diinginkannya  tidak dapat terpenuhi; (2) penghindaran  sosial dan rasa tertekan dalam situasi  yang baru atau berhubungan dengan  orang asing atau baru. Individu yang  mengalami gangguan kecemasan sosial  akan   merasa tidak nyaman, gugup dan  malu ketika berada dalam situasi yang  baru   atau   asing   bagi   dirinya;   (3)  penghindaran sosial dan rasa tertekan  yang dialami secara umum atau dengan  orang   yang   dikenal.   Individu   yang  mengalami gangguan kecemasan sosial  akan me rasa tidak nyaman dan tidak  percaya diri saat melakukan interaksi  dengan orang yang sudah dikenalnya.  Faktor Penyebab Kecemasan Sosial  Hofmann (2010, hlm. 226 - 239)  menyebutkan   ada   tiga   faktor   yang  dapat menyebabkan kecemasan sosial  yaitu: (1) faktor   genetik. Hanya 5%  faktor   genetik   sebagai   penyebab  kecemasan sosial sehingga pengaruh  gen   masih   dianggap   sangat   kecil  terhadap   kecemasan   sosial   yang  dialami individu; (2) faktor orang tua.  Anak - anak   yang   cemas   cenderung  memiliki   orang   tua   dengan   perilaku  ya ng cemas pula. Serta tidak peka nya  orang   tua   terhadap   gangguan   yang  dialami   anak   akan   mempengaruhi  tingkat kecemasan sosial yang dialami  remaja.  Teknik Restrukturisasi Kognitif  Konsep   kognitif   perilaku  diadaptasi   dari   Cognitive   Behavioral  Therapy   (CBT)   yang   bersumber   dari  psikologi   behavior   pada awal abad ke 20  (McLeod,   J   2008,   hlm.   139).  Restrukturisasi   kognitif   merupakan  salah satu teknik dari konseling kognitif  perilaku yang dikemukakan oleh Aaron  Beck,   yang   dipandang   oleh   beberapa  ahli sebagai teknik   yang lebih integratif  dan merupakan teknik yang memiliki  pengaruh   dari   pendekatan   cognitive  therapy   dan   behavioral therapy . Terapi  kognitif   meliputi   mengubah   cara  berfikir,   kepercayaan,   sikap,   asumsi,  imajinasi   dan   memfasilitasi   individu  belajar   mengenali   dan   mengubah  kesalahan   dalam   aspek   kognitif,  sedangkan   aspek   behavioral   meliputi  mengubah hubungan yang salah antara  situasi permasalahan dengan kebiasaan  mereaksi   permasalahan,   belajar  mengubah   perilaku,   menenangkan  pikiran dan tubuh sehingga merasa leb ih  baik serta berfikir lebih jelas (Rusmana  2017, hlm. 84).  Restrukturisasi kognitif merupakan  alternatif teknik dari konseling kognitif  perilaku yang telah dikembangkan oleh  beberapa ahli kognitif perilaku, seperti  Michael   Mahoney   dan   Donald  Meichenbaum.   Teknik   restrukturisasi  kognitif pada dasarnya meyakini pola  pemikiran   manusia   terbentuk   melalui  proses   stimulus - kognisi - respon   (SKR)  yang saling berkaitan dan membentuk  semacam   jaringan   SKR   dalam   otak  manusia,   dimana   proses   kognitif  menjadi   faktor   penentu   dalam\n\n90  menjelaskan   bagaimana   manusia  berfikir, merasa dan bertindak  (Oemarjoedi 2003, hlm. 6).  Tujuan   Teknik  Restrukturisasi Kognitif  Menurut Ranta, K. et al (2015, hlm.  230)   tujuan   teknik   restrukturisasi  kognitif   adalah   untuk   beralih   dari  pemikiran   yang   tidak   realistis   ke  pemikiran   yang   lebih   realistis   dan  membantu remaja lebih efektif untuk  mengelola kecemasannya, yang paling  terpenting   dari   teknik   restrukturisasi  kognitif   adalah   bukan   hanya   untuk  mencapai pemikiran yang positif saja  tetapi mencapa i pemikiran yang realistis.  Proses   pemikiran   realistis   melibatkan  langkah - langkah   berikut   :   (1)  mengidentifikasi peristiwa/ situasi yang  menyebabkan terjadinya kecemasan; (2)  mengidentifikasi   pemikiran   dibalik  terjadinya kecemasan; (3) mengevaluasi  seberap a   realistis   pemikiran   itu,  misalnya   dengan   mencari   bukti;   (4)  mempertimbangkan   seberapa   realistis  konsekuensi   yang   diharapkan;   (5)  mengidentifikasi   pemikiran   realistis  untuk mengganti pemikiran yang tidak  realistis.  Implementasi   Teknik  Restrukturisasi   K ognitif   Untuk  Mereduksi Kecemasan Sosial Remaja  Agar   dapat   secara   efektif  menggunakan   teknik   restrukturisasi  kognitif, seorang remaja harus terlebih  dahulu   memahami   hubungan   antara  pemikiran dan perasaan/perilaku. Cara  remaja   berfikir   akan   mempengaruhi  pe rasaannya   dan   akan   mempengaruhi  tindakannyanya (Ranta, K. et al 2015,  hlm.   231).   Ketika   remaja   mengalami  kecemasan   sosial,   remaja  mengidentifikasi   pemikiran   seperti  orang lain akan berfikir buruk tentang  saya, saya akan melakukan sesuatu yang  memalukan,   se mua   orang   akan  menertawakan saya, padahal pemikiran  negatif yang dipikirkan remaja tersebut  belum tentu orang lain juga memikirkan  hal tersebut.  Adapun   tahapan   restrukturisasi  kognitif menurut (Dobson & Dobson  2009, hlm. 117 - 129) sebagai berikut: (1)  assesmen dan diagnosa. Assesmen dan  diagnosa ditahap awal bertujuan untuk  memperoleh   data   tentang   kondisi  konseli   yang   akan   ditangani   serta  mengantisi pasi kemungkinan kesalahan  penanganan pada proses konseling; (2)  mengidentifikasi pikiran - pikiran negatif  remaja.   Sebelum   konseli   diberikan  bantuan untuk mengubah pikiran - pikiran  yang   mengalami   disfungsi,   konselor  terlebih dahulu perlu membantu konseli  unt uk   menyadari   disfungsi   pikiran -  pikiran   yang   konseli   miliki   dan  memberitahukan   secara   langsung  kepada konselor; (3) memonitor pikiran -  pikiran negatif   remaja melalui   Thought  Record   (rekaman pikiran).  Berikut   adalah   format   “ Thought  Record”   yang diberikan ke pada konseli  untuk mencatat pikiran - pikiran negatif  konseli;   (4)   intervensi   pikiran - pikiran  negatif remaja menjadi pikiran - pikiran  yang positif. Dobson &Dobson (2009,  hlm. 127) menyatakan bahwa langkah  intervensi   pikiran - pikiran   negatif  diberikan   kepada   ko nseli   apabila  konselor   sudah   mendapatkan   banyak  informasi   mengenai   pikiran - pikiran  negatif   konseli   itu   sendiri   setelah  terkumpul dalam   Thought Record .  SIMPULAN  Kecemasan   sosial   pada   remaja  terjadi   karena   pikiran   irasional   yang  diciptakan   oleh   remaja   itu   sendiri.  Ketika remaja merasa takut, khawatir,  malu,   gugup,   dan   tidak   percaya   diri,  kemungkinan   besar   hal   tersebut  disebabkan   karena   remaja   memiliki  pikiran irasional terhadap dirinya sendiri\n\n91  maupun   reaksi   orang   lain   terhadap  dirinya.  Untuk membantu men gatasi kecemasan  sosial yang dialami remaja, salah satu  teknik   yang   dapat   dilakukan   yaitu  menggunakan   teknik   restrukturisasi  kognitif,   karena   tujuan   dari   teknik  restrukturisasi   kognitif   adalah   untuk  mereduksi   kecemasan   sosial   yang  berfokus   pada   kognitif   ya ng  menyimpang   akibat   individu   tidak  mampu mengelola ketakutannya ketika  melakukan interaksi sosial dengan orang  lain.  REFERENSI  Anggia, M.I (2018). Efektivitas Layanan  Konseling   Kelompok   Teknik  Restrukturisasi   Kognitif   untuk  Mereduksi   Kecemasan  Mneghada pi   Ujian   Siswa   Kelas  VII SMP N 22 Kota Bengkulu.  Jurnal   Ilmiah   Bimbingan   dan  Konseling,   1   (2),   1 - 10.  https://ejournal.unib.ac.id  Arkowitz, J. V. (1975). Socia l Anxiety  and   Self - Evaluation   of  Interpersonal   Performance .  Psychological Reports, 36 (1), 211 -  221.  https://doi.org/10.2466/pr0.1975.3  6.1.211  Bhan, K. P. et al. (2009). Social Anxiety  in   a   Multiple   Sclerosis   Clinic  Population. Multiple Sclerosis, 15  (3),   393 – 398.  https://doi.org/10.1177/13524585  08099143  Bieling,   P.   J,   et   al.   (2006).  CognitiveBehavioral   Therapy   in  Groups.   New York: The Guilford  Press.  Beidel,   D.   C.   et   al.   (1995).   A   New  Inventory to Assess Child Social  Phobia:   the   Social   Phobia   and  Anxiety   Inventory   for   Children.  Psychological Assessment, 7 (1),  73 - 79.  https:/ /www.researchgate.net/publ  ication/230642840  Butler, G. (2008).   Overcoming Social  Anxiety and Shynes: A Self - helf  Guide using Cognitive Behavioral  Techniques.   New   York:   Basic  Book.  Cederlund,   R.   (2013).   Social   Anxiety  Disorder   in   Children   and  Adolescents:   Assesment,  Maintaining   Faktors,   and  Treatment.   Stockholm,   Sweden:  Dapertement   of   Psychology,  Stockholm University.  Dobson, D & Dobson, K. S. (2009).  Evidance - based   Practice   of  Cognitive   Behavioral   Therapy.  New York: The Guilford Press.  Herbert, T. B. (2001). Social Anxiety  Disorder   in   Childhood   and  Adolescent:   Current   Status   and  Future Directions. Clinical Child  and Family Psychology Review, 4  (1),   37 - 61.  https://doi.org/10.1023/A:1 00957  6610507  Hurlock,   E.B.   (2004).   Psikologi  Perkembangan.   Jakarta: PT.  Gelora Aksara Pratama.  Hurlock, E.B. (2002). Alih Bahasa ol eh  Istiwidayanti   &   Soedjarwo .  Psikologi   Perkembangan.   Edisi  ke 5.   Jakarta: Erlangga.  Hofman, S. G. (2010).   Social Anxiety:  Clinical,   Developmental,  and  Social   Perspectives,   Second  Edition.   London   :   Academic  Press, Elsevier.\n\n92  La Greca, A. M. & Lopez, N . (1998).  Social   Anxiety   Among  Adolescents: Linkages with Peer  Relations   and   Friendships.  Journal   of   Abnormal   Child  Psychology,   26   (2),   83 - 94.  https://doi.org/10.1023/A:102268  4520514  McLeod, J. (2008). Alih Bahasa oleh  A.K.   Anwar.   Pengantar  Konseling   :   Teori   dan   Studi  Kasus . Jakarta: Kencana.  Oemarjoedi, A. K.   (2003).   Pendekatan  Cognitive   Behavior   Dalam  Psikoterapi .   Jakarta:   Kreatif  media.  Rakhmat,   J.   (2011).   Psikologi  Komunikasi.   Bandung: PT.  Remaja Rosdakarya.  Ranta, K. et al (2015).   Social Anxiety  and Phobia in Adolescents.   New  York:   Springer   Internationa l  Publishing Switzerland.  Rusmana, N. (2017).   Bimbingan dan  Konseling Kelompok di Sekolah .  Bandung: rizqi press.  Sriarti,   A.   (2008).   Tinjauan   Tentang  Stres.  http://digilib.unsr i.ac.id/TINJAU  AN%20TENTANG%20STRES.p  df  Suryaningrum, C. (2016). Efikasi Diri  dan Kecemasan Sosial: Studi Meta  Analisis.   Jurnal Ilmiah Psi kologi  Terapan,   04   (02),   182193.  http://www.umm.ac.id/index.php/  jipt/",
    "warnings": [],
    "meta": {
      "pages": 7,
      "wordCount": 2483,
      "charCount": 20539
    }
  },
  "topology": {
    "nodes": [
      {
        "id": "n1",
        "label": "Reframe thoughts to ease fear",
        "meta": {
          "role": "spine"
        }
      },
      {
        "id": "n2",
        "label": "Challenges passive acceptance of negativity",
        "meta": {
          "role": "rib"
        }
      },
      {
        "id": "n3",
        "label": "CBT-style mechanism of change",
        "meta": {
          "role": "rib"
        }
      },
      {
        "id": "n4",
        "label": "Assumes rationality cures; risks oversimplifying",
        "meta": {
          "role": "fiber"
        }
      }
    ],
    "links": [
      {
        "from": "n3",
        "to": "n1",
        "kind": "supports",
        "weight": 0.86,
        "id": "n3->n1::supports::0"
      },
      {
        "from": "n2",
        "to": "n1",
        "kind": "challenges",
        "weight": 0.74,
        "id": "n2->n1::challenges::0"
      },
      {
        "from": "n4",
        "to": "n1",
        "kind": "risks",
        "weight": 0.67,
        "id": "n4->n1::risks::0"
      },
      {
        "from": "n3",
        "to": "n2",
        "kind": "operationalizes",
        "weight": 0.71,
        "id": "n3->n2::operationalizes::0"
      },
      {
        "from": "n4",
        "to": "n3",
        "kind": "depends_on",
        "weight": 0.78,
        "id": "n4->n3::depends_on::0"
      }
    ],
    "springs": [
      {
        "a": "n1",
        "b": "n2",
        "restLen": 180.00000000000003,
        "stiffness": 0.74,
        "compliance": 0.013513513513513514,
        "contributors": [
          "n2->n1::challenges::0"
        ],
        "meta": {
          "policyParams": {
            "restLength": 180.00000000000003,
            "compliance": 0.01,
            "dampingScale": 1,
            "meta": {
              "edgeType": "challenges",
              "policyName": "default",
              "policyVersion": "1.0.0"
            }
          },
          "edgeType": "challenges",
          "dampingScale": 1,
          "allEdgeTypes": [
            "challenges"
          ]
        }
      },
      {
        "a": "n1",
        "b": "n3",
        "restLen": 198.00000000000006,
        "stiffness": 0.86,
        "compliance": 0.01744186046511628,
        "contributors": [
          "n3->n1::supports::0"
        ],
        "meta": {
          "policyParams": {
            "restLength": 198.00000000000006,
            "compliance": 0.015,
            "dampingScale": 0.9,
            "meta": {
              "edgeType": "supports",
              "policyName": "default",
              "policyVersion": "1.0.0"
            }
          },
          "edgeType": "supports",
          "dampingScale": 0.9,
          "allEdgeTypes": [
            "supports"
          ]
        }
      },
      {
        "a": "n1",
        "b": "n4",
        "restLen": 180.00000000000003,
        "stiffness": 0.67,
        "compliance": 0.014925373134328358,
        "contributors": [
          "n4->n1::risks::0"
        ],
        "meta": {
          "policyParams": {
            "restLength": 180.00000000000003,
            "compliance": 0.01,
            "dampingScale": 1,
            "meta": {
              "edgeType": "risks",
              "policyName": "default",
              "policyVersion": "1.0.0"
            }
          },
          "edgeType": "risks",
          "dampingScale": 1,
          "allEdgeTypes": [
            "risks"
          ]
        }
      },
      {
        "a": "n2",
        "b": "n3",
        "restLen": 180.00000000000003,
        "stiffness": 0.71,
        "compliance": 0.014084507042253521,
        "contributors": [
          "n3->n2::operationalizes::0"
        ],
        "meta": {
          "policyParams": {
            "restLength": 180.00000000000003,
            "compliance": 0.01,
            "dampingScale": 1,
            "meta": {
              "edgeType": "operationalizes",
              "policyName": "default",
              "policyVersion": "1.0.0"
            }
          },
          "edgeType": "operationalizes",
          "dampingScale": 1,
          "allEdgeTypes": [
            "operationalizes"
          ]
        }
      },
      {
        "a": "n3",
        "b": "n4",
        "restLen": 180.00000000000003,
        "stiffness": 0.78,
        "compliance": 0.01282051282051282,
        "contributors": [
          "n4->n3::depends_on::0"
        ],
        "meta": {
          "policyParams": {
            "restLength": 180.00000000000003,
            "compliance": 0.01,
            "dampingScale": 1,
            "meta": {
              "edgeType": "depends_on",
              "policyName": "default",
              "policyVersion": "1.0.0"
            }
          },
          "edgeType": "depends_on",
          "dampingScale": 1,
          "allEdgeTypes": [
            "depends_on"
          ]
        }
      }
    ]
  },
  "layout": {
    "nodeWorld": {
      "n1": {
        "x": -148.3876566662536,
        "y": 4.637864434518644
      },
      "n2": {
        "x": -30.344350745757485,
        "y": -82.33500517019274
      },
      "n3": {
        "x": -25.32957279165248,
        "y": 85.20036253299169
      },
      "n4": {
        "x": 95.43544106784015,
        "y": 72.028057296927
      }
    }
  },
  "camera": {
    "panX": 27.904646899306165,
    "panY": -1.3441711102759157,
    "zoom": 1
  },
  "analysisMeta": {
    "version": 1,
    "nodesById": {
      "n1": {
        "sourceTitle": "Reframe thoughts to ease fear",
        "sourceSummary": "The central wager is that adolescent social anxiety is largely maintained by distorted interpretations of social situations rather than by the situations themselves. When teens repeatedly read the environment as hostile or judgmental, they accumulate fear that generalizes across school and peer contexts. The text claims that reducing anxiety can be achieved by correcting “wrong” or deviant beliefs that drive irrational thinking. It treats cognitive restructuring as a lever that can shift emotional stability by changing appraisals, not by changing peers or schools. The implied thesis is practical: counseling can intervene upstream at cognition to prevent downstream psychological disturbance. The document positions this as a broadly applicable solution because adolescence is portrayed as a developmental window where learning experiences strongly shape social functioning."
      },
      "n2": {
        "sourceTitle": "Challenges passive acceptance of negativity",
        "sourceSummary": "The opponent is a stance that sees teen social anxiety as an unavoidable byproduct of adolescence, peer pressure, or external social realities. It also pushes back against coping strategies that merely avoid social situations, which reinforce the belief that social contact is dangerous. Another challenged worldview is treating negative feedback or perceived rejection as accurate, stable evidence about the self and others. By describing teens as perceiving inside and outside stimuli “incorrectly” during emotional instability, the text contests the authority of anxiety-driven perception. It implicitly challenges interventions that focus only on behavior management or environmental adjustment without addressing thought content. In doing so, it suggests that leaving irrational beliefs unexamined allows fear to persist and spread through the teen’s social world."
      },
      "n3": {
        "sourceTitle": "CBT-style mechanism of change",
        "sourceSummary": "The bridge to authority is a cognitive-behavioral logic: beliefs shape interpretations, interpretations shape emotions, and emotions shape avoidance patterns. The paper leans on developmental psychology citations (e.g., Hurlock; Herbert) to ground why social acceptance becomes salient in adolescence, making cognition about evaluation especially potent. It uses prevalence and setting-specific findings (e.g., university rates; school-based distress reports) to justify the problem’s scale and typical context. Cognitive restructuring is presented as an implementable counseling technique aimed at identifying irrational thoughts and replacing them with more rational alternatives. This functions as the operational link between diagnosis (social anxiety marked by fear of negative evaluation) and treatment (belief correction). Even though the excerpt is partial, it frames the work as a literature-based review that synthesizes definitions, aspects, causes, goals, and steps of implementation to make the technique appear ready-to-apply."
      },
      "n4": {
        "sourceTitle": "Assumes rationality cures; risks oversimplifying",
        "sourceSummary": "A key hidden axiom is that “rational” thoughts are more accurate and reliably reduce anxiety, and that adolescents can learn to adopt them through structured counseling. Another assumption is that social anxiety is primarily cognitive rather than rooted in chronic peer aggression, trauma, neurobiology, or structural school climates, which may limit how far reframing alone can go. The argument presumes that negative perceptions are distortions more often than they are realistic appraisals, which can be false for teens facing bullying or exclusion. Downstream, this approach empowers counselors by offering a standardized, teachable method that can be deployed in school settings where many distressing social situations occur. It can also reduce stigma by framing anxiety as modifiable thinking patterns rather than fixed personality weakness. The risk is flattening complex social problems into individual cognitive errors, potentially shifting responsibility onto the teen to “think correctly” while under-addressing harmful environments. Another risk is that overemphasis on cognition could neglect behavioral exposure, skills training, family factors, or psychiatric care when symptoms are severe."
      }
    }
  }
}