{
  "version": 1,
  "exportedAt": 1771182747041,
  "title": "Lean Six Sigma Approach To Improve The Production Process In The Garment Company: A Case Study",
  "parsedDocument": {
    "id": "94cec6d1-03fc-4a45-b2e1-84fd0591203f",
    "fileName": "debrina,+13681-Lean+six+sigma_rev.pdf",
    "mimeType": "application/pdf",
    "sourceType": "pdf",
    "text": "JOURNAL OF ENGINEERING AND MANAGEMENT IN  INDUSTRIAL SYSTEM VOL.   11   NO.   2   YEAR   2023  e - ISSN 2477 - 6025  https://doi.org/10.21776//ub.jemis.2023.011.02.7  C ite this Article As   Fibriani ,   Lenny   et al   (202 4 ).   Lean Six Sigma Approach To Improve The Production Process  In The Garment Company: A Case Study . Journal of Engineering and Management in Industrial System, 11( 2 ),  p 153 - 1 68  Paper   Submitted   :   Sept ,   22 th   202 3  Paper Published :   Jan ,   1 0 th   20 24   153  LEAN SIX SIGMA APPROACH TO IMPROVE THE PRODUCTION  PROCESS IN THE GARMENT COMPANY: A CASE STUDY  Lenny Fibriani, Annisa Kesy Garside * , Ikhlasul Amallynda  Department of Industrial Engineering, University of Muhammadiyah Malang  Jl.   Tlogomas   No. 246, 65144 Malang, East Java, Indonesia  Abstract   A company engaged in the garment industry is facing problems that inhibit the production process.  These problems comprise an excess of product defects beyond the specified limits, a   considerable rate of  product returns, delays in product shipment, and disorderly arrangements in storing raw material. This study  aims to determine the root causes of problems and provide recommendations for improvement using the  concept of lean six sigma.   The waste assessment model is used to identify the dominant waste, while the value  stream analysis tools is a method used to analyze the causes of the dominant waste. From the research results,  four dominant wastes are identified, namely waste defects, un necessary inventory, waiting and unnecessary  motion, with percentages of 27.02%, 15.92%, 14.32% and 14.0% respectively.   The results of the analysis  using mapping tools show the details of waste in each dominant waste. Proposed recommendations for  improvem ent are made using the failure mode and effect analysis based on the highest risk priority number for  each dominant waste. The recommendations proposed by the researchers include implementing a standard  operating procedure and work instruction for the sewi ng process; scheduling machine maintenance using  reliability centered maintenance II; planning and scheduling materials using material requirement planning;  implementing line balancing; and designing name tags, visual displays, and storage rack layout.  Keywords :   L e an   Six Sigma, SMAI, WAM, VALSAT, FMEA  1. Introduction  A garment company located in Malang  City   produces   various   kinds   of   garments  including T - shirts, jerseys, shirts, uniforms,  almamater suits, hoodies, and office   uniform.  The total production capacity is 6500 pcs per  month. Production is carried out based on  orders placed by customers (make to order).  The   production   process   stages   include  preparation,   sampling,   cutting,   bundling,  sewing, inspection, ironing, and pa ckaging.  To   meet   consumer   demand,   this  company   is   facing   several   problems   that  hinder the progress of the production process.  These problems include the emergence of  defects waste. The quality control inspection  data indicates product defects with an avera ge  of 8.95% in 2022. Meanwhile, the   specified  limits   applied by the company is 5.0%. In  addition to product defects, there are also a  number of returned products from customers.  The average total return order reached 39.2%  in one year.   With a relatively hi gh percentage  * Corresponding author. Email:   annisa@umm.ac.id  Published online at   http://Jemis.ub.ac.id  Copyright   ©2023   DTI   UB   Publishing.   All   Rights  r eserved  of order returns, the company   incurs losses  due to the need for rework activities, resulting  in additional time and costs. The additional  time required for rework   causes waste waiting  because   the   company   prioritizes   returning  orders from customers for imme diate repair.  As a result, customer satisfaction with the  company's performance decreased.   On   the  other hand, providing the best service is one  of the things that must be applied by the  company in order to continue to maintain  customer confidence   [1] . Another problem  faced by the c ompany is inventory waste,  which   involves   the   accumulation   of   raw  materials on the production floor due to the  procurement of raw materials not being in  accordance with regulations. Additionally, the  improper arrangement of raw materials and  production equ ipment necessitates additional  time for employees to search for the materials  and equipment needed.  The integration between Six Sigma and  Lean is used to achieve zero defects, optimize  production performance, make better product  quality and fast delivery a t optimal costs   [2] ,\n\nJOURNAL OF ENGINEERING AND MANAGEMENT IN  INDUSTRIAL SYSTEM VOL.   11   NO.   2   YEAR   2023  e - ISSN 2477 - 6025  https://doi.org/10.21776/ub.jemis.2023.011.02.7  154  [3] . The application of Lean Six Sigma on the  production process reduces production defects  and increases the sigma value   [4] ,   [5] . The use  of   Waste Assessment   Model   ( WAM)   and  Value   Stream   Analysis   Tools   ( VALSAT)  solves   the   problem   by   identifying   and  analyzing   waste   occurring   within   the  company   [6] ,   [7]   and   [8] . Therefore,   this  research   has   chosen   Lean   Six   Sigma,  employing the WAM, VALSAT, and Failure  Mode and Effect Anal ysis (FMEA) methods  to   propose   improvements   in   garment  production   processes   aimed   at   reducing  defects and overcoming delays.  2.   M ethod s  Lean Six Sigma is one method that can be  used   to   increase   stakeholder   value   by  increasing the number of improvements that  focus on   quality,   process   speed,   customer  satisfaction, cost, and investment capital   [9] .  The Define, Measure, Analyze, Improve, and  Control   (DMAIC)   cycle   is   a   structured  problem - solving procedure widely used and  employed   in   quality   improvement   and  processes. DMAIC is not always associated  with Six Sigma but rather a very common  procedure. For example, it is also used for lean  projects focusing on cycle time reduction,  throughput   improvement,   and   waste  elimination   [10], [11] . This research is limited  to   providing   recommendations   in   the  improvement stage.  2.1   Define  2.1.1   Supplier - Input - Process - Output -  Control  The   depiction   of   the   production  process   using   a   Supplier - Input - Process -  Output - Control   (SIPOC)   diagram   aims   to  illustrate the scope of the   physical flow, which  will be further clarified in the Value Stream  Mapping (VSM).  2.1.2 Value Stream Mapping  The purpose of the development of  VSM is to facilitate the process of identifying  waste in the production process   [12] . In the  process of creating VSM, several data are  required, obtained through direct observation  and interviews with related operators. This  data is used as step - by - step information for the  VSM   diagram.   The   required   data   include  cycle time data, actual tim e data, product  changeover setup time, and machine uptime  percentage   data   during   the   production  process.  2.1.3 Determination of the Weight of Each  Waste with Waste Assessment Model  Waste Assessment Model (WAM) is  one of the models used to facilitate the   search  of a problem related to waste so that it can be  identified and eliminated [12]. The process of  identifying the relationship between waste is  carried out in 2 stages, including [12]:  1)   Creating   a   Waste   Relationship   Matrix  (WRM)   by   weigthing   each   waste  relationship based on the results of the  seven waste relationship questionnaires.  The sum of weights within each row or  column was calculated to derive a score,  indicating the influence of one waste type  on others. This score was then converted  into a perc entage to offer a more simplified  metric.  2)   Creating   a   Waste   Assessment  Questionnaire (WAQ). The first step starts  with calculating the answers to \"from\" and  \"to\" questions of the same waste type. The  second   step   involves   normalizing   the  impact of varying qu estion quantities for  each question type. This is achieved by  dividing each weight in the row by the  corresponding number of questions (N i )  related   to   that   question   type.   Let W j,k  represent the relationship weight the waste  type   j   for each question number   k . The  values in each column under each waste  type can then be aggregated to calculate a  score using equation 1.  𝑆 𝑗   =   ∑   𝑊 𝑗 , 𝑘  𝑁 𝑖  𝑘  𝑘 = 1   (1)  where:  𝑘   = question number (ranges between 1 to  68)  Sj = score of the waste  The   third   step   involves   mitigating   the  impact of null responses. For every waste  type, denoted by the waste columns, each  cell with an assigned weight was counted.  Here, F j   is the frequency (number) of cells  that were assigned a weight other than 0,  for each type of wast e   j . The fourth step  was completely dependent on answering  the assessment questionnaire. The obtained  rows for each type of waste are multiplied  by the weight of each answer, which is\n\nJOURNAL OF ENGINEERING AND MANAGEMENT IN  INDUSTRIAL SYSTEM VOL.   11   NO.   2   YEAR   2023  e - ISSN 2477 - 6025  https://doi.org/10.21776/ub.jemis.2023.011.02.7  155  given the symbol X k . The values in each  column under each type of waste   were  summed to obtain the new score (s j ), as in  equation 2. Following the multiplication,  the count of non - zero cells within each  column   was   conducted   to   acquire   the  occurrence   frequency   (f j )   of   a   specific  scenario.  𝑠 𝑗   =   ∑   𝑋 𝑘   𝑥   𝑊 𝑗 , 𝑘  𝑁 𝑖  𝑘  𝑘 = 1   (2)  The   fifth   step   is   to   obtain   the   initial  indication factor of each type of   waste.  Equation 3 was applied for each type of  waste:  𝑌 𝑗   =   𝑠 𝑗  𝑆 𝑗  𝑥   𝑓 𝑗  𝐹 𝑗  (3)  In order to capture the mutual influence  between different waste types, considerin g  that each type of waste can impact others  while   being   influenced   itself,   Y j   is  multiplied by P j   to derive the final waste  factor (Y j final ), as illustrated in equation  (4).  𝑌 𝑗   𝑓𝑖𝑛𝑎𝑙   =   𝑌 𝑗   𝑥   𝑃 𝑗   =   𝑠 𝑗  𝑆 𝑗  𝑥   𝑓 𝑗  𝐹 𝑗  𝑥   𝑃 𝑗   (4)  Based on the Y j final   value of each waste,  the   types   of   waste   were   ranked   in  descending   order.   Next,   the   dominant  waste will be determined based on the  highest - ranking waste.  2.2   Measure  2.2.1   Determining Critical to Quality for  the Dominant Waste  Critical to Quality (CTQ)   is one of the  quality   characteristics   that   influences   a  product, both during the production process  and when it is already used by customers.  CTQ is used to identify the crucial or essential  quality characteristics for a product or service,  which have a si gnificant impact on customer  satisfaction or meeting specific requirements.  2.2.2 Calculating DPMO and Sigma Level  This stage is carried out to standardize  the quality measurements at each production  stage. Thus, a comparison can be made of  which producti on stage is currently in the  worst   condition.   Defect   Per   Million  Opportunity   (DPMO) is the value of product  defects   calculated   in   one   million  opportunities.   After   obtaining   the   DPMO  value, the sigma level is known by converting  based on the obtained DPMO v alue.  2.3   Analyze  2.3.1   Analysis with   Value Stream Analysis  Tools  Value   Stream   Analysis   Tools  (VALSAT) is a tool used to facilitate the  process   of   analyzing   the   value   stream   to  facilitate   the   identification   of   waste  improvements   that   occur   [13] , [14] .   This  meth od is used to make improvements to  waste within the value stream. The previously  weighted   results   from   the   WAQ   will   be  multiplied by the correlation value between  the waste type and the mapping tool to obtain  scores for each mapping tool. The selection of  mapping   tools   is   done   by   identifying   the  highest score and then detailed of waste will  be analyzed.  2.3.2   Determining   the   Root   Causes   of  Detailed   Waste   Using   Fishbone  Diagram  The   fishbone   diagram   is   used   to  identify   and   organize   the   root   causes   of  detailed wast e that have been detailed in the  previous   stage.   Identification   is   done   by  conducting   interviews with   the production  manager to find out more about the root causes  of detailed waste through analysis of people,  machines, work methods, materials, and the  env ironment.  2.4   Improve  Based on the causes of detailed waste  previously   analyzed   using   the   fishbone  diagram, the next step involves proposing  recommendations for improvement using the  FMEA method. FMEA is used to analyze  potential   failures   based   on   the   causes   of  potential process failures and evaluation of  risk priorities   [15] ,   [16] . In the FMEA, there  exists   a   value   denoting   the   frequency   of  failures (occurrence), the effect of current  failures   (severity),   and   the   likelihood   of  detecting   failures   and   anticipating   them  through   the   monitoring   process   (current  det ection) on a scale ranging of 1 to 10. In this  reserach,   the   assessment   of   severity,  occurrence, and current detection is carried  out by the production manager. The value of  Risk Priority Number (RPN) is obtained from\n\nJOURNAL OF ENGINEERING AND MANAGEMENT IN  INDUSTRIAL SYSTEM VOL.   11   NO.   2   YEAR   2023  e - ISSN 2477 - 6025  https://doi.org/10.21776/ub.jemis.2023.011.02.7  156  the results of multiplying these three   values.  Thus, the highest RPN value will serve as the  priority reference for urgent improvements  aimed at reducing detailed waste.  3. Results  3.1   Define Stage  The first stage of this research is the  define stage. The objective of this stage is to  identify th e most frequent waste occurrences  (dominant waste) within the company. In this  stage, waste identification is carried out using  SIPOC diagrams, VSM, and WAM.  3.1.1   SIPOC diagram  The   SIPOC   diagram   is   designed   to  illustrate the activities or physical flow of   the  production process in outline form, which is  subsequently utilized to create the VSM. Table  1 provides an overview of the SIPOC diagram  for the garment production process.  3.1.2   Value Stream Mapping  Figure   1   shows   the   Current   Value  Stream Mapping (VSM) at M ack Garment.  Based on the VSM diagram results, it is found  that there are 8 production processes and 1  work   in   process   (WIP).   The   WIP   occurs  between   the cutting   process   and   bundling  process for 1900 seconds. The cycle time  stated in the VSM is the standard   time added  with the rating factor and allowance. From  Figure 1, the process with the highest cycle  time is sampling.  3.1.3   Waste Identification  Waste   identification   was   collected  using questionnaires and interviews. The data  suggests   that   companies   conditional ly  experience   seven   types   of   waste   during  production:  a.   Overproduction . There is an excessive  production   of   semi - finished   products.  This activity occurs in the cutting process  because   operators   cut   based   on   the  quantity of inspected fabric rolls rather  than   the production demand. As a result,  there is an excess of cut fabric that will  be used for future orders.  b.   Waiting .   The   occurrence   of   waiting  waste   in   the   company   is   caused   by  several activities. The first activity is the  frequent rework process that often occurs  in the sewing process. With this activity,  the scheduled production process for that  day will halt and wai t until the products  that   need   to   be   reworked   can   be  completed   according   to   the   specified  standards. Another activity causing this  waste is waiting for materials to proceed  to the bundling process because they are  held up in the cutting process. Another  wa iting activity is machine breakdowns  in   the   sewing   department,   causing  sewing operators to wait until the sewing  machines can be repaired and used again.  c.   Transportation .   The   waste   of  transportation in the company occurs due  to   poor   and   disorganized   layout   of  material storage and production tools.  Consequently, during the movement and  storage of materials, additional time may  be   required.   Another   transportation  activity is the separate location of the  sewing process from other production  processes.  d.   Inappropr iate processing.   This type of  waste   occurs   due   to   the   presence   of  additional processes that should not be  necessary.   The   additional   process   is  rework   activity.   This   activity   often  occurs in the sewing process, resulting in  the   company's   production   process  becoming inefficient.  e.   Unnecessary inventory . It was found  that   there   are   additional   handling  activities   for   materials,   semi - finished  products,   and   finished   products.   This  occurs due to the company's inaccuracy  in   meeting   production   needs,  accumulation of s emi - finished products,  and   lengthy   delivery   processes   for  finished goods. As a result of these three  causes, the storage warehouse becomes  congested and requires extra space for  storage processes.  f.   Unnecessary motion . This waste occurs  in the company due to   poor workplace  organization in material and tool storage  areas. This results in operators requiring  additional   effort   and   time   to   prepare  materials   for   the   production   process.  Additionally,   in   the   sewing   process,  operators are still frequently observed  co nsciously   making   unnecessary  movements. For example, erasing sample  markings and recounting the number of  accessories.\n\nJOURNAL OF ENGINEERING AND MANAGEMENT IN  INDUSTRIAL SYSTEM VOL.   11   NO.   2   YEAR   2023  e - ISSN 2477 - 6025  https://doi.org/10.21776/ub.jemis.2023.011.02.7  157  g.   Defects .Product   defects   are   still  frequently found in the sewing process.  This   occurs   because   the   products  produced   do   not   meet   the   quali ty  standards   set   by   the   company.  Inconsistencies   include   imperfect  stitching, incomplete accessory parts in  some   product   areas,   and   inadequate  product cleanliness.  3.1.4 Determination of The Weight and  Rangking of Each Waste   using the WAM  M ethod  Weighting waste using WAM involves  two stages as follows:  1.   Table 2 shows the relationship between  waste that occurs in the company using  WRM. The next step is to convert each  symbol with reference to A = 10, E = 8, I =  6, O = 4, U = 2, and X = 0. The purpose of  creating a waste relationship value is to  find the results and percentage value of  each waste in the matrix.  Table   2.   Waste Relationship Matr ix  F/T   O   I   D   M   T   P   W  O   A   E   U   U   E   X   U  I   I   A   I   I   I   X   X  D   E   E   A   A   E   X   A  M   X   I   E   A   X   O   A  T   O   U   I   O   A   X   O  P   E   I   A   E   X   A   A  O   E   A   A   X   X   X   A  Table 3 shows the conversion results and  percentage of WRM. It is discovered that the  highest   percentage   are   identified   in   from  defects   (D)   with   a   value   of   54   and   a  percentage of 19.42%. This means that if  defect (D) waste occurs, then this waste has a  big potential to cause other wastes to appear.  Table 1.   SIPOC Diagram  Suppliers   Inputs   Processes   Outputs   Customers  X Fabric   Unstitched  Cloth  Machinary  Thread  Needles  Accessories  Button  Zipper  Label  Preparation  Sampling  Cutting  Bundling  Sewing  Finishing & Inspection  Ironing  Packaging  Apparels (T - shirts,  jerseys, shirts,  uniforms, alma   mater  jackets, hoodies,  daily official  clothing, etc.)  Y  Z  Fig 1.   Value stream mapping\n\nJOURNAL OF ENGINEERING AND MANAGEMENT IN  INDUSTRIAL SYSTEM VOL.   11   NO.   2   YEAR   2023  e - ISSN 2477 - 6025  https://doi.org/10.21776//ub.jemis.2023.011.02.7  158  Meanwhile, the value of to defects (D) also  has a high value and percentage with values  of 52 and 18.71% respectively. This shows  that the   existence of defects is caused by the  effects   from   other   waste.   Overproduction  (O),   Unnecessary Inventory   (I), Defect (D),  Unnecessary Motion (M) ,   Transportation (T),  Inappropriate Processing(P), Waiting (W) .  2)   Determining the final result for each waste  using WAQ.   Based on the calculations shown  in Table 4, it can be concluded that the four  most   common   wastes   are   defects,  unnecessary   inventory,   waiting,   and  unnecessary   motion.   With   the   respective  percentage s of 27.02%, 15.92%, 14.32%, and  14.0%. These four wastes are selected based  on the Pareto diagram principle, which is  80:20, where 80% of the problems account  for the causes of 20% of the problems. Next,  these four wastes are referred to as dominant  waste .  3.2   Measure Stage  In the measure stage, Critical to Quality  (CTQ)   is   determined,   and   performance   is  measured in terms of DPMO values to find the  sigma   level   for   each   dominant   waste.   The  establishment of CTQ is used to identify the  factors that serve as benc hmarks for desired  quality   characteristics.   Quality   characteristics  that influence products in the company, both  when they have reached customers and when  they are still in the production process. Table 5  represents the CTQ for each dominant waste.  Table 6   represents the summary of sigma  levels for the four dominant wastes. Based on the  overall results of DPMO calculations and sigma  levels, it can be concluded that the production  process   performance   at   the   company   before  improvement is already good, with an   average  sigma level of 3.50 σ.  Table 6.   DPMO and Waste Level  No   Dominant Waste   DPMO   Sigma  Level  1   Defects   37,994   3.27  2   Unnecessary  Inventory  20,095   3.55  3   Waiting   19,228   3.56  4   Unnecessary  Motion  16,243   3.63  Average   3.50  However,   the   principle   of   continuous  improvement   to   eliminate   waste   remains  essential   until   the   production   process  performance   reaches   a   sigma   level   of   6 σ.  Because   at   a   sigma   level   of   3.50 σ,   it   still  indicates   that   there   are   opportunities   for  improvement   during   the   pro duction   process.  Therefore, the next step is to identify and analyze  the root causes of waste occurrences.  Table 3.   Conversion Results and Percentage of WRM  F/T   O   I   D   M   T   P   W   Score   %  O   10   8   2   2   8   0   2   32   11.51  I   6   10   6   6   6   0   0   34   12.23  D   8   8   10   10   8   0   10   54   19.42  M   0   6   8   10   0   4   10   38   13.67  T   4   2   6   4   10   0   4   30   10.79  P   8   6   10   8   0   10   10   52   18.71  W   8   10   10   0   0   0   10   38   13.67  Score   44   50   52   40   32   14   46   278   100  %   15.83   17.99   18.71   14.39   11.51   5.04   16.55   100  Table 4.   Waste Assessment Questionaire Results  O   I   D   M   T   P   W  Score   ( 𝑌 𝑗   )   0.58   0.61   0.62   0.59   0.62   0.61   0.53  𝑃 𝑗   Factor   182.18   219.96   363.33   196.67   124.21   94.19   226.17  Final Result  ( 𝑌 𝑗   𝑓𝑖𝑛𝑎𝑙 )   106.54   134.47   228.15   117.9   77.87   58.29   120.95  Final Result (%)   12.61   15.92   27.02   13.97   9.22   6.90   14.32  Ranking   5   2   1   4   6   7   3\n\nJOURNAL OF ENGINEERING AND MANAGEMENT IN  INDUSTRIAL SYSTEM VOL. 11 NO.   2   YEAR 2023  e - ISSN 2477 - 6025  https://doi.org/10.21776/ub.jemis.2023.011.02.7  159  Table 5.   Critical to Quality (CTQ)  Dominant Waste   Critical to Quality (CTQ)  Defect   Imperfect stitching  Incomplete accessories  Product   cleanliness issues  Unnecessary  Inventory  Fabric inventory due to excessive purchasing/stocking  Semi - finished product inventory due to waiting for processing (bundling)  Finished product inventory due to lengthy delivery periods to customers  Waiting   Wa iting during the sewing process due to the priority of rework activities  Waiting occurs because the bundling process is halted, waiting for the arrival of  materials (WIP) from the cutting process  Operator negligence during work leading to   product damage  An irregular production schedule  Material or raw material inspections take too long  Repair of problematic/damaged machines  Unnecessary  Motion  Operators engaging in unnecessary activities and working without standard   procedures  during the production process  Unorganized storage racks  The absence of labels on shelves  3.3   Analyze Stage  The third stage of completing this research  is the analyze stage, which is carried out to  identify and find   the root causes of problems or  issues in the production process based on the  data obtained and processed in the define and  measure stages. Some of the steps involved  include   analyzing   waste   with   VALSAT   and  creating cause - and - effect diagrams.  3.3.1   Analysing Wast e Using VALSAT  The VALSAT   method   is   employed   to  analyze detailed waste associated with dominant  waste. Detailed waste is identified based on  selected mapping tools, where the selection is  based on the score calculation from the seven  available mapping tool s.   The score for each  mapping tool is obtained by multiplying the  weight of each waste with the correlation value  between the waste and that mapping tool.  Table 7 shows the top 3 tools with the  highest   scores,   namely:   Process   Activity  Mapping (PAM), Supp ly Chain Response Matrix  (SCRM), and Quality Filter Mapping (QFM).  Subsequently,   the   identification   of   detailed  waste using each mapping tool is explained as  follows:  1)   Process Activity Mapping  Process Activity Mapping is used to map  and classify activities into value - added (VA),  necessary non - value added (NNVA), and non -  value added (NVA) categories. The activities  include   5   components:   Operation   (O),  Transportation (T), Inspection (I), Storage ( S),  and Delay (D). Based on the recapitulation in  Table   8,   the   total   time   used   for   the   entire  production process is 16469 seconds across 55  activities. There are 23 Operation activities with  a total completion time of 7940 seconds, 10  Transportation activi ties with a total completion  time of 2194 seconds, 5 Inspection activities  with a total completion time of 1061 seconds, 5  Storage activities with a total completion time  of 971 seconds, and 12 Delay activities with a  total completion time of 4303 seconds.  From Table 8, it is known that non - value  added (NVA) activities have a percentage of  30.91%, indicating that these activities should be  reduced or minimized as they do not add value  to the company. Upon review, most of the non -  value added (NVA) activities   arise due to a  significant amount of delay time. Delay occurs  due to waiting waste and unnecessary motion  waste. The detailed waste for waiting waste  includes   waiting   time   for   semi - finished  products, such as bundles, to be continued or  sent   to   the   sewing   process.   Meanwhile,   the  detailed waste for unnecessary motion waste  includes the additional activities of preparing  and searching for tools to be used during the  production process, resulting in a considerable  amount of waiting time.  2)   Supply Chain Response   Matrix  With the Supply Chain Response Matrix, the  company can more easily monitor increases and  decreases in lead time and inventory levels in  each area of the supply chain. Based on figure 2,  it is known that the time used to meet customer  demand is   20.78 days with a cumulative value of  physical stock days of 2.78 days or 13.37% of  the total production fulfillment time.\n\nJOURNAL OF ENGINEERING AND MANAGEMENT IN  INDUSTRIAL SYSTEM VOL.   11   NO.   2   YEAR   2023  e - ISSN 2477 - 6025  https://doi.org/10.21776//ub.jemis.2023.011.02.7  160  Table 7.   Selection of Mapping Tools  Waste   Weight   PAM   SCRM   PVM   QFM   DAM   DPA   PS  Overproduction   12 . 61   12 . 61   37 . 83   12 . 61   37 . 83   37 . 83  Waiting   14 . 32   128 . 88   128 . 88   14 . 32   42 . 96   42 . 96  Transport ation   9 . 22   82 . 98   9. 22  Inappropriate Processing   6 . 90   62 . 1   20 . 7   6 . 9   62 . 1  Unnecessary Inventory   15 . 92   47 . 76   143 . 28   47 . 76   143 . 28   47 . 76   15. 92  Unnecessary Motion   13 . 97   125 . 73   13 . 97  Defect   27 . 02   27 . 02   243 . 18  Score   487 . 08   323 . 96   82 . 78   262 . 69   224 . 07   190 . 65   25 . 14  Rank   1   2   6   3   4   5   7  Table 8.   Recapitulation of PAM results  Activities   Total   Total time (s)   Percentage (%)  Operation   23   7940   44.93  Transportation   10   2194   12.41  Inspection   5   1061   6.00  Storage   5   971   5.49  Delay   12   4303   31.14  Total   55   16469  Value Added   16   6717   38.01  NonValue Added   12   4262   30.91  Necessary NonValue Added   27   5490   31.07  Total   55   16469  Fig .   2   SCRM  The raw material storage area has the highest  physical stock days value at 1.11 days. This  occurs due to the accumulation of raw materials  in the   storage area.  3)   Quality Filter Mapping  Quality Filter Mapping is a tool used to evaluate  overall defect waste. In this study, the most  common and recurring defect wastes are product  defects and internal scrap defects. These defects  refer to flaws that pass   through to the customer  and those identified visually during inspection  processes.   Table   9   presents   QFM   data   on  products.   According   to   Table   9,   it   can   be  concluded that imperfect stitching is the most  frequently encountered detailed waste. These  defects oc cur during the sewing process.  3.3.2   Identifying   Root   Causes   of   Detailed  Waste with Fishbone Diagram  Figures 3 - 6 represent the identification of  the   root   causes   of   detailed   waste   based   on  interviews and discussions with the production  manager. Based on   Figure 3, it can be observed  that the activity of waiting on bundling process  to be sent to the sewing process is caused by  several root causes, including:  • Human factor: causes of detailed waste in the  waiting type include operator negligence due to  mono tonous   work   movements,   operators  1,11  2,15  2,78  3  11  18  0   2   4   6   8   10   12   14   16   18   20  raw material storage area  production process area  finished product storage area  Supply Chain Response Matrix  Cumulatives DPS   Cumulatives LT\n\nJOURNAL OF ENGINEERING AND MANAGEMENT IN  INDUSTRIAL SYSTEM VOL. 11 NO.   2   YEAR 2023  e - ISSN 2477 - 6025  https://doi.org/10.21776/ub.jemis.2023.011.02.7  161  working at different speeds, and rework due to  products not meeting company standards.  •   Material   factor:   one   cause   is   the   lengthy  inspection time for raw materials.  • Method factor: the cause is unclear production  schedule s   and   uneven   workloads   in   each  process.  • Machine factor: problems with waiting time  detailed   waste   occur   due   to   machine  breakdowns and require additional time for  repairs.  From Figure 4, it can be seen that the  activity of searching for materials and tool s  during   the   production   process   is   caused   by  several   root   causes,   including:   operator  indiscipline, lack of direct supervision from the  company,   absence   of   SOP   provided   by   the  company leading operators to work based on  initial training, disorganized storag e racks for  raw   materials   and   tools,   and   inadequate   air  circulation and lack of air conditioning.   Based on  Figure 5, it can be observed that the accumulation of  raw materials during the production process is caused  by several factors:  •   Human factor: The unn ecessary inventory waste  due   to   human   factors   occurs   because   of   the  company's   lack   of   accuracy   in   fulfilling   raw  material   requirements   for   production.   This  happens because there is no forecast method for  replenishing/stocking raw materials.  •   Material factor : The analysis of the root causes of  unnecessary   inventory   waste   from   material  factors can be viewed from three causes. Firstly,  excessive   raw   material   replenishment   occurs  because the company has not properly scheduled  production   replenishment.   Secondly,   there   is  additional   warehouse   space   for   storing   raw  materials   or   defective   products.   Thirdly,   the  cutting process generates excessive semi - finished  products  Based on Figure 6, it can be determined that the  defects in imperfect stitching are caused   by  several causes and root causes:  •   Human   factor:   The   cause   of   operator  negligence   during   work   and   the   lack   of  operator   skill   during   sewing.   Operator  negligence   occurs   because   the   operator  works in a hurry to meet targets. Additionally,  a lack of knowledge abo ut defect criteria in  the sewing process leads to operators being  unaware of product defects.  •   Material   factor:   The   cause   of   imperfect  stitching is slippery raw materials, making it  difficult to control the fabric during sewing.  •   Method factor: The root   causes of imperfect  stitching can be examined from four causes.  Firstly,   incorrect   thread   component  installation   methods   due   to   rushed  installation and lack of understanding of the  correct   installation   method.   Secondly,  incorrect sewing methods due to insu fficient  operator   skills.   Thirdly,   unstable   operator  hands   when   holding   fabric,   resulting   in  unstable and untidy stitches. Lastly, the lack  of SOP for sewing.  •   Machine   factor:   The   cause   of   imperfect  stitching   defects   is   old   machines.  Additionally,   the   absen ce   of   specific  maintenance schedules for sewing machines.  •   Environmental factor: The cause of stitching  defects is inadequate lighting in the room due  to dim lighting.  Table 9.   Percentage of Each Defects  Waste Type   Detailed wa ste   Pcs   Total percentage (%)  Defect  Imperfect stitching   3686   56.81  Incomplete accessories   1408   21.7  Product cleanliness issues   1394   21.48\n\nJOURNAL OF ENGINEERING AND MANAGEMENT IN  INDUSTRIAL SYSTEM VOL. 11 NO.   2   YEAR 2023  e - ISSN 2477 - 6025  https://doi.org/10.21776/ub.jemis.2023.011.02.7  162  Fig .   3   Fishbone Diagram for The Detailed Waste on Waiting  Fig .   4   Fishbone Diagram for Detailed Waste on Unnecessary Motion\n\nJOURNAL OF ENGINEERING AND MANAGEMENT IN  INDUSTRIAL SYSTEM VOL.   11   NO.   2   YEAR   2023  e - ISSN 2477 - 6025  https://doi.org/10.21776//ub.jemis.2023.011.02.7  163  Fig .   5   Fishbone Diagram for Detailed Waste on Unnecessary Inventory  Fig .   6   Fishbone Diagram for Detailed Waste on Defects  4)   Improve Stage  The   final   stage   of   this   study   is   the  improvement stage, which aims to determine and  identify recommendations for improvement to  reduce the problem experienced by the c ompany  during the production process. Based on the  detailed waste causes previously analyzed using  the   fishbone   diagram,   recommendations   for  improvement will be provided using the FMEA  method. Table 10 shows the potential failure  causes with the highest RP N values for each  dominant waste .\n\nJOURNAL OF ENGINEERING AND MANAGEMENT IN  INDUSTRIAL SYSTEM VOL. 11 NO.   2   YEAR 2023  e - ISSN 2477 - 6025  https://doi.org/10.21776/ub.jemis.2023.011.02.7  164  Table 10.   Summary of improvement proposals using FMEA  Dominant  waste  Ranking  RPN   Cause of Failure   Proposed Recommendations  Defects   1   512  Additional time is  required for reworking  product defects or  products returned by  customers  •   Implementing the   establishment   of SOPs and  work instructions for the sewing process,  along with supervision to ensure that the  SOPs are properly followed by operators  •   Providing   and   enforcing   maintenance  scheduling for sewing machines before the  production process begins   [17] .  Unnecessary  inventory   2   448  Accumulation of semi -  finished products in the  storage area  •   Planning   and   scheduli ng   material  requirements to prevent the company from  leaving   behind   excess   raw   materials  (overstock) that may occupy storage space  unnecessarily   [18] .  Waiting   3   448  Production   processes  are hindered and  inefficient  •   Conducting   inspections   and   checks   at  production process stages that are prone to  causing   defects   and   waiting   time,   while  implementing the creation of SOPs (Standard  Operating Procedures) on how to conduct  proper produ ction processes .  •   Dividing   workload   to   achieve   greater  efficiency using line balancing methods   [19] ,  [20] .  Unnecessary  motion   4   392  Additional time is  needed to search for  mat erials or tools to be  used  •   Creating tag names for storage racks for  each type of material color and tools .  •   Establishing visual display warnings for  placing items after use .  •   Designing a new rack layout for organizing  materials and tools .  4.   Discussion  Based   on   Table   10,   the   p roposed  recommendation   can be explained in detail as  follows:  Proposed recommendation   1:   Implementing  the   establishment   of   SOPs   and   work  instructions for the sewing process  Based on the results of the highest RPN  value in the detailed waste defect and waiting,  the   researcher   proposes   Standard   Operating  Procedure (SOP) for the sewing process. The  SOP will function as a wr itten rule for operators  in order to reduce errors while carrying out  production   activities.   The   implementation   of  SOPs in the company can significantly increase  productivity and has the possibility to eliminate  waste in the long run   [21] .  Proposed   recommendation   2:   Scheduling  machine   maintenance   using   Reliability  Centered Maintenance II  Reliability   Centered Maintenance   ( RCM )   II  is a systematic method in determining what  needs to be done to prepare each equipment,  machine, and physical facility to continue to  fulfill its function in the operation process. The  use of the RCM II method is useful for kno wing  the level of machine reliability and subsequent  machine maintenance. The output obtained   of  this method   is the selection   of maintenance  intervals   and   maintenance   policies.   The  maintenance policy is divided into 3 categories:  1.   Scheduled on   condition task, which is used to  detect and check the occurrence of potential  failures. Based on the typical cases that occur  in   the   company,   maintenance   scheduling  should   be   carried   out   for   the   following  activities:   o verdeck   sewing   machine  components (loo per and foot pressure), by  lubricating   every   12   hours   and   Kansai  machine   components   (feed   dog),   by  lubricating every 12 hours.  2.   Scheduled   discard   task,   used   to   schedule  component replacement before its lifetime  expires,   without   having   to   wait   for   the  machin e to be damaged. Based on the typical  case that occurs in the company, scheduling\n\nJOURNAL OF ENGINEERING AND MANAGEMENT IN  INDUSTRIAL SYSTEM VOL. 11 NO.   2   YEAR 2023  e - ISSN 2477 - 6025  https://doi.org/10.21776/ub.jemis.2023.011.02.7  165  should be done for the replacement of the  following   components:   single   needle  machine   on   needle   component,   every   81  hours   and   kansai   machine   on   needle  component, every 54 hou rs.  3.   Scheduled finding task, which is used to  perform   component   maintenance   before  identifying the cause of the damage. In this  case,   the   identification   of   the   cause   of  damage   is   assumed   to   be   conducted   on  several   machines,   including   the   obras  machine (feed   dog component) and overdeck  machine (feed dog component and thread  tension).  Proposed recommendation   3:   Planning and  scheduling   material   using   Material  Requirement Planning   (MRP)  Based on the   analysis of   the potential causes  of   failure   regarding   the   detail ed   waste  unnecessary   inventory,   it   is   known   that   the  highest   RPN   value   lies   in   the   company's  unavailability   in   determining   or   scheduling  material   inventory   before   carrying   out   the  production process. The   company only considers  the   availability   of   raw   materials   when   the  company   receives   an order and the existing  inventory in the warehouse.   Because of this,   the  company   still   experiences   overstock   in   the  warehouse   which   results in stacking.   Therefore,  it is n ecessary to plan and   schedul   raw materials  using   MRP . The implementation of the   Lot For  Lot   technique   required production plan to carry  out   production   only   as needed and   to keep   the  amount of inventory to a minimum or sufficient  level   [22] .  Proposed   r ecommendation   4: Implem enting  l ine   b alancing  One of the causes of   the   waste waiting is the  existence   of   bottleneck   in   one   of   the  workstations , namely the bundling process. The  imbalance of the production line can be seen  from the accumulation of semi - finished products  (WIP)   in   the   storage   area. As   a   result,   the  production process in the company becomes  slow, inefficient and causes delays in product  delivery. Thus, the right trajectory balance is  needed to solve production efficiency problems.  The Largest Candidate Rule method is a method  of combining   workstations in order   from   the  largest to smallest processing time while still  considering   the   position   on   the   precedence  diagram. The Largest Candidate Rule   (LCR)  method is the most commonly used method  because it is   convenient   and   produces   good  results   [19] .  Proposed   r ecommendation   5:   Design ing  name tag , visual display ,   and storage rack  layout  The   highest RPN value in the detail of waste  unnecessary motion   are   the condition of the  material storage rack   and   messy   tools. This  happens because the storage rack   does not have  a ny   description of each type of fabric and tools .  This   causes   operators   or   workers   to   spend  additional time to find and return materials and  to ols   that they need . In addition, the   incidence   of  missing   tools can also occur.   Therefore ,   based on  these problems,   the   researcher   has developed  proposals in the form of designing   name tag,  visual display, and new layout   for storage   rack s  Most   of   the   mater ial   arrangements   in   the  company are mixed up   and   do not follow   the  fabric   color   grouping.   Upon   the   latest  observation in   the storage area, it was seen that  there   have been   name tag   on the edges of the  storage shelves. However,   they are only made of  HVS   pap er,   making   them   very   fragile   and  shabb y.   In   addition,   the writing   was almost  illegible   and some had even been removed from  the   rack.   To   overcome   these   problems,   the  researcher   designed a new   name tag as shown in  Figure 7 .  . Description of fabric color / tools  Shelf  Number  Shelf Levels  Shelf Squence  Number  Fig .   7   Name tag for storage rack\n\nJOURNAL OF ENGINEERING AND MANAGEMENT IN  INDUSTRIAL SYSTEM VOL.   11   NO.   2   YEAR   2023  e - ISSN 2477 - 6025  https://doi.org/10.21776//ub.jemis.2023.011.02.7  166  Fig .   8   visual display in the storage area  Fig .   9   Proposed new storage rack layou t  In addition to making a   name tag   design, the  researcher also added a proposal in the form of  making   a   visual   display.   The   goal   is   to  familiarize operators   with the habit of   tidy ing   up  and return ing   tools after   each   use. Figure   8  demonstrates   the visual disp lay proposed by the  researcher.   Figure   9   depicts proposed layouts for  rack   1 , 2 and 3 . The arrangement and placement  of fabric in these layout proposals are based on  the   results   of   classification   using   the ABC  method. In this approach, items categorized as A  are placed at the bottom of   the shelves to allow  operators easy access to fabric materials or tools  that will be used frequently. On the other hand,  items in categories B and C are positioned at the  top shelves because materials with colors falling  within these categories are infrequ ently used  during the production process. As a result, this  new   layout   prioritizes   the   arrangement   of  frequently used production necessities .  In   our   research,   it   should   be  acknowledged   that   the   proposed  recommendation   for   the   company   lack  consideration   for   the   cost   aspect   of  implementation,   and   furthermore,   the  prioritization of these recommendations has not  been   determined.   These   factors   repres ent  limitations of this study.  5 .   Conclusion  The result of waste identification using the  WAM method shows that the dominant waste  that often occurs in the company during the  production   process   is   defects,   unnecessary  inventory,   waiting   time,   and   unnecessary  motion. Based on the calculation results of the  sigma level for all dominant wastes, it is known  that the average sigma level obtained is 3.50 σ\n\nJOURNAL OF ENGINEERING AND MANAGEMENT IN  INDUSTRIAL SYSTEM VOL. 11 NO.   2   YEAR 2023  e - ISSN 2477 - 6025  https://doi.org/10.21776/ub.jemis.2023.011.02.7  167  with a DPMO value of 22,750. Based on the  highest   RPN   values   in   the   FMEA,   the  researchers propose im provement suggestions to  reduce each dominant waste in the production  process.   These   proposed   recommendations  include implementing the establishment of SOPs  and work instructions for the sewing process ,  s cheduling   machine   maintenance   using  Reliability Centered Maintenance II,   planning  and   scheduling   material   using   Material  Requirement   Planning ,   implementing   line  balancing,   and   designing   name   tag,   visual  display, and storage rack layout .   For further  research, it is advisable to carry out this   study  until the stage of implementing the proposed  recommendations   and   conducting   the  development of control stages.  REFERENCES  [ [1]   Abdul   Gofur,   “Kepuasan   Pelanggan,”  Ris.   Manaj.   dan   Bisnis   Fak.   Ekon.  UNIAT ,   vol. 4, no. 1, pp. 37 – 44, 2019.  [2]   I. Daniyan, A. Adeodu, K. Mpofu, R.  Maladzhi,   and   M.   G.   Kana - Kana  Katumba, “Application of lean Six Sigma  methodology using DMAIC approach for  the   improvement   of   bogie   assembly  process in the railcar industry,”   Heliyon ,  vol.   8,   no.   3,   p.   e09043,   2022,   doi:  10.1016/j.heliyon.2022.e09043.  [3]   P. Alexander, J. Antony, and E. Cudney,  “A   novel   and   practical   conceptual  framework to support Lean Six Sigma  deployment   in   manufacturing   SMEs,”  Total Qual. Manag. Bus. Excell. , vol.   33,  no. 11 – 12, pp. 1233 – 1263, 2022, doi:  10.1080/14783363.2021.1945434.  [4]   Ahmad, L. L. Salomon, and Y. K. Sari,  “Implementasi   Lean   Six   Sigma   dan  Usulan   Perbaikan   untuk   Meminimasi  Non Value Added pada Proses Produksi  Kertas di PT.   Pelita Cengkareng Paper, ”  Semin. Nas. Teknol. dan Sains II . Peran  Perguru.   Tinggi   dalam   Pembang.  Berkelanjutan untuk Kesejaht. Masy. , pp.  23 – 24, 2016.  [5]   S.   Sarman   and   D.   Soediantono,  “Literature Review of Lean Six Sigma  (LSS)   Implementation   and  Recommendations for Implementati on in  the   Defense   Industries,”   J.   Ind.   Eng.  &amp; Manag. Res. , vol. 3, no. 2, pp. 24 –  34, 2022.  [6]   M. Rizky, Rochman Fitrah; Sugiono, and  R.   Y.   Efranto,   “Valsat   Untuk  Mengurangi   Waste   Pada   Proses  Finishing (Studi Kasus di PT .   Temprina  Media Grafika Nganju k),”   J. Rekayasa  dan Manaj. Sist. Ind. , vol. 2, no. 4, pp.  907 – 918, 2014.  [7]   M. Maulana, E. Suhendar, and A. T.  Prasasty, “Penerapan Lean Management  Untuk   Meminimasi   Waste   Pada   Lini  Produksi   CV.   Mandiri   Jaya   Dengan  Metode   WAM   Dan   VALSAT,”   J.  Optimasi Tek.   Ind. , vol. 5, no. 1, p. 1,  2023, doi: 10.30998/joti.v5i1.13747.  [8]   F.   Nurprihatin,   N.   E.   Yulita,   and   D.  Caesaron,   “Usulan   Pengurangan  Pemborosan Pada Proses,”   Prof. Akuntan  Menuju Sustain. Bus. Pract. , pp. 809 –  818, 2017.  [9]   M. L. George, J. Maxey, D. T.   Rowlands,  and   M.   Upton,   The   Lean   Six   Sigma  Pocket   Toolbook:   A   Quick   Reference  Guide to Nearly 100 Tools for Improving  Quality   and   Speed .   McGraw - Hill  Education, 2004.  [10]   V. Gaspersz,   The Executive Guide To  Implementing Lean Six Sigma . Jakarta:  PT Gramedi a Pustaka Utama, 2007.  [11]   R. R. Renggarsari, A. K. Garside, T. Y.  Rosiani, and T. E. Saputro, “Integration  of   Lean   Six   Sigma   and   Theory   of  Inventive   Problem   Solving   for  Minimizing   Waste   in   Shuttlecock  Industry,”   J. Ilm. Tek. Ind. , vol. 22, no. 2,  pp.   239 – 250,   2023,   doi:  https://doi.org/10.23917/jiti.v22i2.23012  .  [12]   N. Nelfiyanti, D. Saputra, and R. A. M.  Puteri,   “Penerapan   Value   Stream  Mapping   Tools   dalam   Meminimasi  Pemborasan Proses Packing Part Disc di  line Servis,”   JISI J. Integr. Sist. Ind. , vol.  10 ,   no.   1,   p.   9,   2023,   doi:  10.24853/jisi.10.1.9 - 18.  [13]   J.   Haekal,   “Integration   of   Lean  Manufacturing and Promodel Simulation  on Repair Production Process Flow of  Polysilane Bottle Printing Using VSM,  WAM, VALSAT, And RCA Methods:  Case   Study   Packaging   Manu facturing  Company,”   Int. J. Sci. Adv. , vol. 3, no. 2,  pp.   235 – 243,   2022,   doi:  10.51542/ijscia.v3i2.15.  [14]   P. Hines and N. Rich, “The Seven Tools\n\nJOURNAL OF ENGINEERING AND MANAGEMENT IN  INDUSTRIAL SYSTEM VOL. 11 NO.   2   YEAR 2023  e - ISSN 2477 - 6025  https://doi.org/10.21776/ub.jemis.2023.011.02.7  168  for Value Stream Mapping,”   Appl. Mech.  Mater. , vol. 17, no. 1, pp. 553 – 564, 1997.  [15]   E.   D.   Krisnanti   and   A.   K.   Garside,  “Penerapan Lean Manufacturing untuk  Meminimasi Waste Percetakan Box,”   J.  INTECH Tek. Ind. Univ. Serang Raya ,  vol. 8, no. 2, pp. 99 – 108, 2022, doi:  10.30656/intech.v8i2.4780.  [16]   A.   wicaksono   Wicaksono   and   F.  Yuamita,   “Pengendalian   Kualitas  Produksi Sarden   Mengunakan   Metode  Failure   Mode   and   Effect   Analysis  (FMEA) Untuk Meminimumkan Cacat  Kaleng Di PT. Maya Food Industries,”   J.  Teknol. dan Manaj. Ind. Terap. , vol. 1,  no.   I,   pp.   1 – 6,   2022,   doi:  10.55826/tmit.v1ii.6.  [17]   N. P. Riyanto, W. A. Jauhari, A. Aisyati,  and   C.   N.   Rosyidi,   “Developing  maintenance policy   for   solna printing  machine   with   reliability   centered  maintenance (RCM II),”   Lect. Notes Eng.  Comput. Sci. , vol. 2210, no. Jan uary,  2014.  [18]   S.   Zahrotul   Uyun,   “Analisis  Pengendalian   Persediaan   Bahan   Baku  dengan Menggunakan Metode Material  Requirement Planning (MRP),” vol. 22,  no. 1, pp. 103 – 113, 2020.  [19]   D. Nur   et al. , “Analisis Line Balancing  pada Produksi Jaket Style AS2 Li ne 12  Departemen Sewing PT XYZ,” 2022.  [20]   F. Valentina Sitanggang and dan Pringgo  Widyo   Laksono,   “Penerapan   Line  Balancing pada PT. XYZ dengan Metode  Largest   Candidate   Rule   dan   Ranked  Positional Weight,” pp. 1 – 10, 2022.  [21]   A. R. Muhaling, I. D. Paland eng, and J.  S. B. Sumarauw, “Implementasi Standar  Operasional   Prosedur   (Sop)   Layanan  Pada   Pt.   Taspen   (Pesero)   Cabang  Manado,”   J.   EMBA   J.   Ris.   Ekon.  Manajemen, Bisnis dan Akunt. , vol. 9, no.  4, pp. 572 – 581, 2021.  [22]   S.   A.   Azis   and   A.   Sutoni,   “Analisis  Pe rsediaan   dalam   Proyek   Renovasi  Gedung Menggunakan Metode Material  Requirements Planning dengan Teknik  Lot For Lot,” no. 2007, pp. 2 – 3, 2019.",
    "warnings": [],
    "meta": {
      "pages": 16,
      "wordCount": 7775,
      "charCount": 52238
    }
  },
  "topology": {
    "nodes": [
      {
        "id": "n1",
        "label": "Taruhan utama: menekan cacat-keterlambatan",
        "meta": {
          "role": "spine"
        }
      },
      {
        "id": "n2",
        "label": "Lawan: kerja reaktif dan ad hoc",
        "meta": {
          "role": "rib"
        }
      },
      {
        "id": "n3",
        "label": "Jembatan: DMAIC plus alat waste",
        "meta": {
          "role": "rib"
        }
      },
      {
        "id": "n4",
        "label": "Aksioma tersembunyi serta risiko kuasa",
        "meta": {
          "role": "fiber"
        }
      }
    ],
    "links": [
      {
        "from": "n2",
        "to": "n1",
        "kind": "challenges",
        "weight": 0.78,
        "id": "n2->n1::challenges::0"
      },
      {
        "from": "n3",
        "to": "n1",
        "kind": "operationalizes",
        "weight": 0.9,
        "id": "n3->n1::operationalizes::0"
      },
      {
        "from": "n4",
        "to": "n3",
        "kind": "depends_on",
        "weight": 0.74,
        "id": "n4->n3::depends_on::0"
      },
      {
        "from": "n4",
        "to": "n1",
        "kind": "risks",
        "weight": 0.66,
        "id": "n4->n1::risks::0"
      },
      {
        "from": "n3",
        "to": "n2",
        "kind": "replaces",
        "weight": 0.7,
        "id": "n3->n2::replaces::0"
      }
    ],
    "springs": [
      {
        "a": "n1",
        "b": "n2",
        "restLen": 180.00000000000003,
        "stiffness": 0.78,
        "compliance": 0.01282051282051282,
        "contributors": [
          "n2->n1::challenges::0"
        ],
        "meta": {
          "policyParams": {
            "restLength": 180.00000000000003,
            "compliance": 0.01,
            "dampingScale": 1,
            "meta": {
              "edgeType": "challenges",
              "policyName": "default",
              "policyVersion": "1.0.0"
            }
          },
          "edgeType": "challenges",
          "dampingScale": 1,
          "allEdgeTypes": [
            "challenges"
          ]
        }
      },
      {
        "a": "n1",
        "b": "n3",
        "restLen": 180.00000000000003,
        "stiffness": 0.9,
        "compliance": 0.011111111111111112,
        "contributors": [
          "n3->n1::operationalizes::0"
        ],
        "meta": {
          "policyParams": {
            "restLength": 180.00000000000003,
            "compliance": 0.01,
            "dampingScale": 1,
            "meta": {
              "edgeType": "operationalizes",
              "policyName": "default",
              "policyVersion": "1.0.0"
            }
          },
          "edgeType": "operationalizes",
          "dampingScale": 1,
          "allEdgeTypes": [
            "operationalizes"
          ]
        }
      },
      {
        "a": "n1",
        "b": "n4",
        "restLen": 180.00000000000003,
        "stiffness": 0.66,
        "compliance": 0.015151515151515152,
        "contributors": [
          "n4->n1::risks::0"
        ],
        "meta": {
          "policyParams": {
            "restLength": 180.00000000000003,
            "compliance": 0.01,
            "dampingScale": 1,
            "meta": {
              "edgeType": "risks",
              "policyName": "default",
              "policyVersion": "1.0.0"
            }
          },
          "edgeType": "risks",
          "dampingScale": 1,
          "allEdgeTypes": [
            "risks"
          ]
        }
      },
      {
        "a": "n2",
        "b": "n3",
        "restLen": 180.00000000000003,
        "stiffness": 0.7,
        "compliance": 0.014285714285714287,
        "contributors": [
          "n3->n2::replaces::0"
        ],
        "meta": {
          "policyParams": {
            "restLength": 180.00000000000003,
            "compliance": 0.01,
            "dampingScale": 1,
            "meta": {
              "edgeType": "replaces",
              "policyName": "default",
              "policyVersion": "1.0.0"
            }
          },
          "edgeType": "replaces",
          "dampingScale": 1,
          "allEdgeTypes": [
            "replaces"
          ]
        }
      },
      {
        "a": "n3",
        "b": "n4",
        "restLen": 180.00000000000003,
        "stiffness": 0.74,
        "compliance": 0.013513513513513514,
        "contributors": [
          "n4->n3::depends_on::0"
        ],
        "meta": {
          "policyParams": {
            "restLength": 180.00000000000003,
            "compliance": 0.01,
            "dampingScale": 1,
            "meta": {
              "edgeType": "depends_on",
              "policyName": "default",
              "policyVersion": "1.0.0"
            }
          },
          "edgeType": "depends_on",
          "dampingScale": 1,
          "allEdgeTypes": [
            "depends_on"
          ]
        }
      }
    ]
  },
  "layout": {
    "nodeWorld": {
      "n1": {
        "x": -151.31243323041232,
        "y": 2.07734107590112
      },
      "n2": {
        "x": -34.262884558071576,
        "y": -85.97257980760727
      },
      "n3": {
        "x": -28.576331922869155,
        "y": 81.95202101453692
      },
      "n4": {
        "x": 91.2883579956191,
        "y": 78.534669356722
      }
    }
  },
  "camera": {
    "panX": 31.588835054869847,
    "panY": 1.9867728281358694,
    "zoom": 1
  },
  "analysisMeta": {
    "version": 1,
    "nodesById": {
      "n1": {
        "sourceTitle": "Taruhan utama: menekan cacat-keterlambatan",
        "sourceSummary": "Dokumen ini mempertaruhkan klaim bahwa penggabungan Lean dan Six Sigma dapat menurunkan cacat, retur, dan keterlambatan pengiriman pada perusahaan garmen make-to-order. Ia menempatkan masalah sebagai gabungan kegagalan mutu (defect di atas batas 5%), beban rework akibat retur yang tinggi, dan hambatan aliran kerja akibat waiting serta penataan material yang buruk. Taruhan praktisnya bukan sekadar perbaikan lokal, melainkan peningkatan kinerja produksi yang terukur melalui identifikasi waste dominan dan prioritisasi tindakan. Dengan menekankan zero defects, biaya optimal, dan pengiriman cepat, teks mengunci keberhasilan pada metrik operasi yang bisa dibandingkan sebelum-sesudah. Narasi masalah juga mengaitkan dampak ke kepuasan pelanggan, sehingga keberhasilan diposisikan sebagai pemulihan kepercayaan pasar. Secara implisit, dokumen mengasumsikan bahwa variasi proses dan pemborosan adalah penyebab utama kerugian, bukan perubahan permintaan atau strategi bisnis. Hasil yang diharapkan adalah rekomendasi perbaikan yang dapat diimplementasikan langsung di titik proses seperti sewing, pemeliharaan mesin, dan perencanaan material."
      },
      "n2": {
        "sourceTitle": "Lawan: kerja reaktif dan ad hoc",
        "sourceSummary": "Worldview yang ditantang adalah kebiasaan operasional yang reaktif: memperbaiki masalah lewat rework setelah retur, mempercepat lewat prioritas darurat, dan membiarkan ketidakteraturan material sebagai “biaya normal” kerja. Praktik pengadaan bahan baku yang tidak sesuai aturan dipotret sebagai sumber inventory berlebih, sehingga perusahaan bekerja dengan penyangga stok dan pencarian material alih-alih aliran yang terencana. Model kerja ini juga membuat waiting muncul karena rework mengganggu antrian produksi reguler, sehingga lead time bertambah tanpa meningkatkan nilai pelanggan. Dokumen menolak asumsi bahwa inspeksi akhir cukup untuk menjaga mutu, karena angka defect rata-rata 8,95% menunjukkan kebocoran sistemik di proses. Ia juga menentang pandangan bahwa cacat dan retur adalah konsekuensi alami variasi pesanan make-to-order yang tidak bisa dikendalikan. Dengan menyorot keterlambatan dan biaya tambahan, teks menggeser fokus dari heroik “pemadam kebakaran” menuju disiplin proses dan pencegahan. Secara halus, ini juga mengkritik tata kelola kerja yang minim standar, karena solusi kunci yang diajukan adalah SOP dan instruksi kerja yang memperkecil improvisasi operator."
      },
      "n3": {
        "sourceTitle": "Jembatan: DMAIC plus alat waste",
        "sourceSummary": "Kerangka yang memberi otoritas pada klaim adalah Lean Six Sigma melalui siklus DMAIC sebagai prosedur pemecahan masalah yang terstruktur. WAM dipakai sebagai mekanisme kuantifikasi untuk memilih waste dominan, sehingga prioritas tidak ditentukan oleh opini atau keluhan paling keras. VALSAT digunakan untuk mengurai penyebab waste dominan lewat pemetaan dan analisis aliran nilai, yang bertujuan menghubungkan gejala (misalnya waiting) dengan sumber proses spesifik. FMEA dijadikan alat pengambil keputusan untuk merumuskan rekomendasi berdasarkan Risk Priority Number tertinggi, sehingga tindakan perbaikan tampak berbasis risiko dan bukan daftar keinginan. Kombinasi ini mengubah situasi yang kacau menjadi portofolio masalah yang dapat dipetakan, diukur, dan diprioritaskan. Dari hasil awal, dokumen menunjukkan empat waste dominan—defects, unnecessary inventory, waiting, dan unnecessary motion—dengan persentase yang membangun argumen bahwa fokus utama harus pada mutu dan aliran. Rekomendasi yang muncul (SOP sewing, RCM II, MRP, line balancing, visual management dan layout rak) berfungsi sebagai “paket intervensi” yang menjangkau manusia, mesin, dan material. Dengan demikian, jembatan metodologisnya adalah mengkonversi keluhan bisnis menjadi bukti numerik dan tindakan standar yang bisa diaudit."
      },
      "n4": {
        "sourceTitle": "Aksioma tersembunyi serta risiko kuasa",
        "sourceSummary": "Argumen ini bergantung pada asumsi bahwa data inspeksi, angka retur, dan pengukuran waste cukup representatif untuk menilai kesehatan sistem produksi tanpa bias pencatatan atau variasi musiman. Ia juga mengasumsikan bahwa waste yang teridentifikasi (misalnya defect 27,02%) punya hubungan kausal yang bisa ditangani dengan alat standar seperti SOP, MRP, dan line balancing, bukan sekadar korelasi sementara. Ada asumsi organisasi mampu mengadopsi disiplin baru—kepatuhan SOP, jadwal maintenance, dan visual management—tanpa resistensi budaya atau keterbatasan kompetensi. Pendekatan ini memberi daya (downstream power) karena memungkinkan manajemen membenarkan standardisasi, pengendalian kerja, dan investasi perbaikan berdasarkan angka risiko, sehingga prioritas menjadi lebih “objektif” dan mudah dikomunikasikan. Namun ada risiko penyederhanaan: proses kreatif make-to-order dapat dipaksa ke template yang terlalu kaku, sehingga fleksibilitas terhadap variasi desain dan ukuran bisa tergerus. Ada pula risiko Goodhart: ketika metrik defect, waiting, atau RPN dijadikan target, perilaku bisa bergeser ke manipulasi pencatatan atau pemindahan waste ke area yang tidak terukur. Rekomendasi seperti MRP dan RCM II juga mengandaikan kualitas data perencanaan dan keandalan pencatatan downtime, sehingga implementasi buruk dapat menambah beban administrasi tanpa hasil. Secara keseluruhan, dokumen menguatkan logika kontrol proses, tetapi dapat “memipihkan” faktor manusia seperti beban kerja, insentif, dan variasi keterampilan yang sering menjadi akar mutu di lantai produksi."
      }
    }
  }
}