{
  "version": 1,
  "exportedAt": 1771251070686,
  "title": "Development of a happiness measurement scale based on the Quran and Hadith using the Rasch Model",
  "parsedDocument": {
    "id": "80266372-e6de-4cea-93ee-22b0eea15bf9",
    "fileName": "Tes.pdf",
    "mimeType": "application/pdf",
    "sourceType": "pdf",
    "text": "Psikoislamika: Jurnal Psikologi dan Psikologi Islam  Volume   22 , No   2   ( 2025 ), pp.   1 51 — 1 59  ISSN 1829 - 5703 (p), 2655 - 5034 (e)  https://doi.org/10.18860/psi.v22i 2 . 34756  Copyright © 202 5   Bunga Alodia I . , Irianti Usman, Isman Rahmani Y . , Muhammad Fajar Siddiq R .   1 51  Development of a happiness measurement scale based on the Quran  and Hadith using the Rasch Model  Bunga Alodia Isfara 1 * ,   Irianti Usman 1 , Isman Rahmani Yuson 1 , Muhammad Fajar  Siddiq Ramadhan 2  1   Faculty of Social and Human Sciences ,   Universitas Muhammadiyah Bandung ,   Bandung, Indonesia  2   Faculty of Usul al - Din ,   Al - Azhar University , Kairo, Mesir  Received Ju ne   2 3 , 202 5   | Accepted   December 03 , 202 5 | Published   December   10 , 202 5  Abstract :   Happiness has long been a central theme in psychology, both in  conceptual discourse and in the development of measurement instruments.  However, no existing scale integrates the moral and spiritual dimensions of  happiness derived from the Qur’an and Hadith   within a robust psychometric  framework ensuring measurement invariance. The Qur’an and Hadith, as  universal sources of guidance, encompass principles of psychological and  spiritual   well - being   that   transcend   religious   and   cultural   boundaries,  consistent wit h the Islamic concept of rahmatan lil ‘alamin ( mercy to all  creation ). This study aimed to develop a Qur’an -   and Hadith - based happiness  measurement scale using the Rasch model. The scale construction was  grounded in prior qualitative research that identified three core Islamic  constructs of happiness: patience ( sabr ), self - control ( mujāhadah al - nafs ),  and gratitude ( shukr ). A total of 450 participants from diverse religious  backgrounds in Indonesia completed the instrument. Data were analyzed  using Confirmatory Factor Analysis (CFA) and the Rasch Model to evaluate  validity, reliability, and item fit. The results indicated   that the three - factor  model exhibited excellent fit indices (CFI = 0.926, TLI = 0.910, RMSEA = 0.068)  with high composite reliability (ω = 0.893). Rasch analysis further showed Infit  MNSQ values ranging from 0.78 to 1.40 and item separation indices above 3 ,  suggesting strong discriminant power and internal consistency. Overall, the  findings demonstrate that happiness in Islam can be operationalized through  measurable constructs rooted in patience, self - control, and gratitude. The  proposed scale offers a psy chometrically sound and universally applicable  instrument grounded in Islamic ethical principles, contributing to cross -  cultural research on psychological well - being.  Keywords :   happiness; Qur’an; hadith; Rasch model; psychometrics  Copyright ©202 5 . The Authors. Published by Psikoislamika: Jurnal Psikologi dan Psikologi  Islam. This is an open access article under the CC BY NO SA. Link:   Creative Commons   —  Attribution - NonCommercial - ShareAlike 4.0 International   —   CC BY - NC - SA 4.0  Introduction  The scientific study of happiness has evolved from hedonistic notions of pleasure toward eudaimonic  frameworks emphasizing meaning, virtue, and self - realization (Ryff, 1989; Seligman et al., 2004; Diener  et al., 2018). Within this paradigm, happiness is of ten operationalized through affective balance, life  1    Corresponding Author: Bunga Alodia Isfara, email:   bungalodiaisfr@gmail.com ,   Universitas  Muhammadiyah Bandung, Jl. Soekarno Hatta No.752, Kota Bandung 40614, Indonesia\n\nBunga Alodia I . , Irianti Usman, Isman Rahmani Y . , Muhammad Fajar Siddiq R .  Psikoislamika: Jurnal Psikologi dan Psikologi Islam   152  satisfaction, and psychological well - being. However, despite the growing sophistication of positive  psychology, its dominant models — such as PERMA (Positive Emotion, Engagement, Relationships,  Meaning, and Accomplishment) and Ryff’s six dimensions of well - b eing — tend to privilege secular and  individualistic interpretations (Karim & Noor, 2019). They offer valuable insights into human flourishing  but often underrepresent spiritual transcendence and moral accountability, which are central to Islamic  psychology.  Islamic scholarship offers a broader and integrative understanding of well - being. Classical and  contemporary thinkers describe happiness through interrelated concepts such as   sa‘ādah ,   falah , and   al -  salaam .   Sa‘ādah   refers to the inner harmony between intellect, body, and soul, achieved through moral  purification and divine proximity (Al - Ghazali, 2001; Al - Farabi, 2021).   Falah   represents ultimate success  in this world and the hereafter, implying that happiness must include ethical striving and spiritual fulfillment  (QS Al - Mu’minun: 1 – 11). Meanwhile,   al - salaam   denotes a state of peace resulting from surrender to God’s  will — an emotional and existential equilibrium unavailable through hedonic satisfaction alone (Hamdan,  2016; Shihab, 2006). These notions position happiness not merely as an emotional state but as a   moral -  spiritual achievement rooted in faith and self - discipline.  Comparatively, positive psychology views happiness as a subjective and measurable construct  grounded in cognitive appraisal and emotional experience. While models such as PERMA recognize  meaning   and   relationships,   they   do   not   explicitly   incorporate   transce ndental   purpose   or   divine  accountability (Karim & Noor, 2019; Omais & Dos Santos, 2022). Thus, Islamic and Western paradigms  converge in valuing self - regulation, gratitude, and virtue but diverge in their metaphysical foundations.  Islamic psychology situat es well - being within the person – God relationship, emphasizing the harmony  between spiritual and psychological dimensions (Ahmad & Javed, 2021; Hasan & Taufik, 2020).  Existing instruments such as the Oxford Happiness Questionnaire (Hills & Argyle, 2002) and the  Satisfaction with Life Scale (Diener et al., 1985) have advanced happiness measurement yet remain limited  in moral and spiritual scope. These scales operationali ze happiness primarily through cognitive judgments  and affective balance, omitting transcendental or ethical dimensions. Consequently, their use within  Muslim populations may fail to capture culturally embedded aspects of well - being, such as patience ( sabr ),  self - control ( mujahadah al - nafs ), and gratitude ( syukr ) — virtues that are central to the Qur’anic and  Prophetic conception of happiness (Sofia & Sari, 2018).  Recent   scholarship   on   Islamic   psychology   emphasizes   the   need   for   culturally   grounded   yet  scientifically robust instruments (Nurhayati & Sari, 2022; Al - Kandari & Thomas, 2023). Cross - cultural  measurement research also advocates for scale adaptation that res pects local moral and religious  frameworks while ensuring psychometric fairness (Bond & Fox, 2015; Zhang & Chen, 2024). Developing  a Rasch - based Islamic happiness scale therefore fills a critical gap — bridging empirical rigor and spiritual  authenticity, and   contributing to the global discourse on culturally responsive well - being assessment .  Method  Research Design  This quantitative, non - experimental study employed a   scale development   approach comprising five  phases: (1) conceptual exploration based on the Qur’an and Hadith, (2) item generation, (3) expert\n\nDevelopment of a happiness measurement scale based on the Quran and Hadith using the Rasch Model  Psikoislamika: Jurnal Psikologi dan Psikologi Islam   153  validation, (4) pilot testing, and (5) psychometric analysis using CFA and the Rasch model. The Rasch  model was chosen for its capability to estimate person – item interactions with invariance and objectivity,  producing interval - level measures from ordinal L ikert data (Linacre, 2022). Items were initially derived  from thematic analysis of Qur’anic verses on happiness (Sofia & Sari, 2018). From 440 valid responses,  220 were retained based on completion rate and response consistency. Rasch analysis confirmed re liability  (α = 0.91) and unidimensionality through PCA of residuals, supporting the theoretical coherence of the  three identified dimensions.  Participants  A total of 450 adults aged 18 – 43 participated, representing various religions (199 Muslims, 12  Christians, 4 Catholics, 2 Hindus, 2 Buddhists, and 1 Confucian). Eligibility criteria included adulthood  and the cognitive capacity to assess self - perceived hap piness.   The sample size exceeded the recommended  minimum for factor analysis (≥300; Tabachnick & Fidell, 2003) and met standards for Rasch analysis  (VanVoorhis & Morgan, 2007).  Instrument  The scale was developed based on Qur’anic and Hadith references previously identified by Sofia and  Sari (2018). Each item was rated using a 5 - point Likert scale ranging from 1 (Strongly Disagree) to 5  (Strongly Agree). The instrument was designed to captur e three core dimensions of happiness derived from  Islamic teachings. The first dimension, Patience (Sabr), reflects the individual’s ability to endure hardship  and regulate anger. The second, Self - control (Mujahadah al - nafs), represents disciplined behavio r, mindful  speech, and continuous self - improvement. The third, Gratitude (Syukr), encompasses thankfulness, the  avoidance of   wastefulness, and   appreciation of one’s blessings and   environment. Together, these  dimensions embody the moral and spiritual founda tions of happiness within the Islamic worldview.  Procedure  Five experts in Tafsir, Islamic Psychology, and Islamic Philosophy validated the content using the  Content Validity Ratio (CVR; Lawshe, 1975). All items met the minimum CVR threshold (>0.99).  Following expert revision, the instrument was distributed online . Of 450 responses, 220 qualified for  analysis after data screening.  Data Analysis  Data analysis was conducted in two main stages. First, Confirmatory Factor Analysis (CFA) was  performed using JASP to assess the factorial validity of the scale. Model fit was evaluated using standard  indices, including the Comparative Fit Index (CFI), Tuc ker – Lewis Index (TLI), Root Mean Square Error  of Approximation (RMSEA), and Standardized Root Mean Square Residual (SRMR), following the  guidelines of Kline (2016). Second, Rasch analysis was conducted using JMetrik to examine item fit,  reliability, and pe rson – item separation according to Fisher’s (1993) criteria.  Result  Construct Validity (CFA)\n\nBunga Alodia I . , Irianti Usman, Isman Rahmani Y . , Muhammad Fajar Siddiq R .  Psikoislamika: Jurnal Psikologi dan Psikologi Islam   154  Confirmatory Factor Analysis (CFA) demonstrated that the three - factor model provided a good fit to  the data, with fit indices meeting recommended thresholds (CFI = 0.926, TLI = 0.910, RMSEA = 0.068).  Standardized factor loadings ranged from 0.425 to 0.819   (p < 0.001), exceeding the 0.40 criterion for  acceptable loadings (Hair et al., 2010). The composite reliability coefficient (ω = 0.893) indicated high  internal consistency and supported the unidimensionality of the construct. These results confirm that th e  proposed three - factor structure   patience, self - control, and gratitude   adequately represents the conceptual  model of happiness grounded in Islamic teachings.  Rasch Analysis  Rasch measurement analysis further supported the psychometric robustness of the scale. Infit Mean  Square (MNSQ) values ranged from 0.78 to 1.40, falling within the acceptable range (0.77 – 1.30) and  indicating appropriate item – person interaction. The item se paration index (3.46) and person separation  index (2.16) both exceeded the minimum acceptable values, suggesting strong discrimination across  different levels of ability. Item reliability (0.92) and person reliability (0.82) were classified as very good,  c onfirming the scale’s stability and precision in distinguishing respondents’ levels of happiness.  Final Scale Structure  The finalized scale comprised 15 items distributed across three dimensions that reflect the Qur’anic  and Prophetic conceptualization of happiness:  Table 1  Descriptive Summary  Dimension   Indicators   No.   of  Items  Patience (Sabr)   Controlling anger, avoiding negative assumptions   4  Self - control   (Mujahadah   al -  nafs)  Guarding speech, continuous self - improvement   5  Gratitude (Syukr)   Avoiding   waste,   appreciating   blessings   and   the  environment  6  Overall, both the CFA and Rasch analyses demonstrate that the final 15 - item instrument possesses  excellent psychometric properties, theoretical coherence, and cultural validity consistent with Islamic  perspectives on psychological well - being.  Discussion  This study developed and validated a happiness scale grounded in Qur’anic and Prophetic teachings  using the Rasch model. The three core dimensions — patience ( sabr ), self - control ( mujahadah al - nafs ), and  gratitude ( syukr )demonstrated strong validity and reliability, reflecting the psychological essence of Islamic  happiness.   The   three   identified   dimensions   parallel   established   constructs   in   positive  psychology.   Sabr   aligns   with   perseverance   and   emotional   regulation   (PERMA’s   engagement  dimension);   mujahadah   al - nafs   reflects   self - discipline   and   purpose;   syukr resonates   with   positive  relationships and meaning (Ryff, 1989; Seligman, 2011). The three identified dimensions parallel  established constructs in positive psychology.   Sabr   aligns with perseverance and emotional regulation  (PERMA’s   engagement   dimension);   mujahadah   al - nafs   reflects   self - discipline   and   purpose;   syukr  resonates with positive relationships and meaning (Ryff, 1989; Seligman, 2011).\n\nDevelopment of a happiness measurement scale based on the Quran and Hadith using the Rasch Model  Psikoislamika: Jurnal Psikologi dan Psikologi Islam   155  Integration of Classical and Contemporary Perspectives  Classical Islamic scholars such as Al - Ghazali (2001) and Al - Farabi (2021) conceptualized happiness  as the perfection of the soul achieved through purification and divine proximity. Ibn Sina and Ibn ‘Arabi  further described happiness as a state of intellect ual and spiritual harmony (Lala & Alwazzan, 2023).  Modern   psychology   parallels   this   understanding   through   the   eudaimonic   concept   of   well - being,  emphasizing meaning, purpose, and moral growth (Ryff, 1989; Seligman, 2011). Integrating these  perspectives reveals that happiness is both transcendental and measu rable, bridging theology with empirical  science. Recent empirical studies also support this synthesis, showing that spirituality contributes  significantly to psychological well - being among Muslim populations (Ahmad & Javed, 2021; Hidayat &  Rahman, 2021).  Patience (Sabr)  In positive psychology, patience aligns with emotional regulation and resilience (Fredrickson, 2001;  Tugade & Fredrickson, 2004). Benatov and Oren (2022) found that gratitude and resilience promote post -  traumatic growth, consistent with the Qur’anic notion   of   sabr   as transformative endurance (QS Al - Baqarah:  153). This study supports the view that patience is not passive submission but an adaptive process that  fosters inner strength, self - regulation, and long - term well - being.  Self - Control  Self - control reflects the integration of rational, behavioral, and moral faculties. It is central to  maintaining ethical stability and personal harmony. Consistent with Bandura’s (1997) theory of self -  regulation, individuals who monitor their thoughts, spe ech, and actions report higher life satisfaction and  emotional balance. Qur’anic teachings reinforce this discipline as a moral foundation for happiness (QS Al -  Mu’minun: 3). Supporting this, Hidayat and Rahman (2021) and Nurhayati and Sari (2022) found tha t self -  control, when coupled with gratitude, significantly predicts happiness among Muslim students.  Gratitude (Syukr)  Gratitude is a key predictor of subjective well - being (Emmons & McCullough, 2003) and in Islam,  represents an existential awareness of divine blessings and moral responsibility (QS Ibrahim: 7; Hasan &  Taufik, 2020). Beyond emotion, gratitude manifests beha viorally through generosity, simplicity, and care  for others and the environment. This aligns with contemporary evidence that gratitude enhances resilience  and interpersonal connectedness, reinforcing psychological and spiritual flourishing (Benatov & Oren ,  2022; Al - Kandari & Thomas, 2023).  Rasch Model Implications  Methodologically, the Rasch model enhances cross - cultural fairness and precision in measurement  (Barlagne & Godbout, 2019; Zhang & Chen, 2024). By ensuring measurement invariance, the model  eliminates bias across respondents with different backgrounds. The   high reliability and separation indices  observed in this study confirm that the instrument distinguishes varying levels of happiness accurately and  objectively (Bond & Fox, 2015).  Practical Implications\n\nBunga Alodia I . , Irianti Usman, Isman Rahmani Y . , Muhammad Fajar Siddiq R .  Psikoislamika: Jurnal Psikologi dan Psikologi Islam   156  The developed scale offers a culturally sensitive, empirically sound framework for assessing happiness  that integrates moral and spiritual dimensions. It may be utilized in cross - religious well - being studies and  in counseling settings that adopt faith - inte grated psychological interventions (Abdel - Khalek, 2019; Karim  & Noor, 2019). The findings underscore the possibility of uniting scientific rigor with Islamic spiritual  principles to enrich global psychology.  Limitations and Future Research  The study’s main limitation lies in the predominance of Muslim participants, which may affect   the  generalizability of the findings across diverse   cultural contexts. Future research should employ diverse  samples for cross - cultural validation and examine longitudinal effects of patience, self - control, and  gratitude on well - being. Expanding this approach may lead to the development of integrated models   of  spiritual resilience applicable across faith traditions.  Conclusions  This   study   successfully   developed   and   validated   a   Qur’an -   and   Prophetic - based   happiness  measurement scale using the Rasch model. The resulting instrument comprises three empirically supported  dimensions — patience (sabr), self - control (mujahadah al - nafs), an d gratitude (syukr) — which collectively  represent the psychological and spiritual essence of Islamic happiness. These dimensions capture the  integration of moral discipline, emotional regulation, and spiritual awareness as the foundation of genuine  well - bei ng.  The use of the Rasch model ensured measurement fairness, invariance, and precision across  participants, establishing the scale’s psychometric robustness. Conceptually, the findings affirm that  happiness in Islam transcends momentary affect or subjective pl easure; it embodies a balanced state of the  soul grounded in faith, morality, and self - regulation. In doing so, this study bridges classical Islamic thought  and modern psychometric science, offering a spiritually grounded yet empirically rigorous approach   to  understanding well - being.  Practically, the developed scale provides a culturally sensitive tool applicable in cross - religious well -  being studies and faith - integrated counseling practices. It advances the discourse on culturally responsive  measurement by embedding spiritual and ethi cal values into psychological assessment. Future research  should extend validation to more diverse cultural and religious populations and explore the longitudinal  effects of patience, self - control, and gratitude on well - being. Such efforts will contribute   to developing a  universal, spiritually anchored model of happiness that unites theological wisdom with contemporary  psychological science.  References  Abdel - Khalek, A. M. (2019). Happiness, health, and religiosity: Significant associations in  adolescents from Egypt and Saudi Arabia.   Mental Health, Religion & Culture, 22 (1), 73 – 83.  https://doi.org/10.1080/13674676.2019.1571078  Abdel - Khalek, A. M., & Lester, D. (2020). The association between religiosity, well - being, and mental  health: A cross - cultural study.   Mental Health, Religion & Culture, 23 (5), 438 – 450.  https://doi.org/10.1080/13674676.2020.1731765\n\nDevelopment of a happiness measurement scale based on the Quran and Hadith using the Rasch Model  Psikoislamika: Jurnal Psikologi dan Psikologi Islam   157  Ahmad, S., & Javed, S. (2021). Qur’anic perspectives on happiness: Conceptual and empirical  insights.   Journal of Religion and Health, 60 (5), 2958 – 2972.  https://doi.org/10.1007/s10943 - 021 - 01243 - 9  Al - Farabi, Kassymbayev, K., & Ibrahim, A. F. M. (2021). The concept of “happiness” in the works of  Al - Farabi and the religions of Islam.   Adam Alemi, 90 (4), 133 – 141.  https://doi.org/10.48010/2021.4/1999 - 5849.14  Al - Ghazali. (2001).   The alchemy of happiness   (C. Field, Trans.). Islamic Texts Society.  Al - Kandari, A., & Thomas, A. (2023). Faith, gratitude, and subjective well - being among Muslim  youth: A structural equation approach.   Journal of Positive Psychology, 18 (3), 354 – 366.  https://doi.org/10.1080/17439760.2023.2168942  Bandura, A. (1997).   Self - efficacy: The exercise of control.   W. H. Freeman.  Barlagne, C., & Godbout, N. (2019). Rasch measurement in psychological scale validation:  Applications and limitations.   Frontiers in Psychology, 10 , 1421.  https://doi.org/10.3389/fpsyg.2019.01421  Benatov, J., & Oren, L. (2022). Resilience and gratitude as predictors of post - traumatic growth  among emerging adults.   Psychological Trauma, 14 (3), 492 – 501.  https://doi.org/10.1037/tra0001050  Bond, T. G., & Fox, C. M. (2015).   Applying the Rasch model: Fundamental measurement in the human  sciences   (3rd ed.). Routledge.   https://doi.org/10.4324/9781315814698  Diener, E., Emmons, R. A., Larsen, R. J., & Griffin, S. (1985). The Satisfaction with Life Scale.   Journal of  Personality Assessment, 49 (1), 71 – 75.   https://doi.org/10.1207/s15327752jpa4901_13  Diener, E., Oishi, S., & Tay, L. (2018). Advances in subjective well - being research.   Nature Human  Behaviour, 2 (4), 253 – 260.   https://doi.org/10.1038/s41562 - 018 - 0307 - 6  Emmons, R. A., & McCullough, M. E. (2003). Counting blessings versus burdens: An experimental  investigation of gratitude and subjective well - being in daily life.   Journal of Personality and  Social Psychology, 84 (2), 377 – 389.   https://doi.org/10.1037/0022 - 3514.84.2.377  Fredrickson, B. L. (2001). The role of positive emotions in positive psychology: The broaden - and -  build theory of positive emotions.   American Psychologist, 56 (3), 218 – 226.  https://doi.org/10.1037/0003 - 066X.56.3.218  Hamdan, A. (2016). Islamic psychology: The “nafs” and self. In M. J. Elias (Ed.),   Islamic perspectives  on psychology and human behavior   (pp. 55 – 72). Routledge.  Hasan, N., & Taufik, M. (2020). Developing Islamic well - being scales based on Qur’an and Hadith.  Journal of Muslim Mental Health, 14 (2), 63 – 82.  https://doi.org/10.3998/jmmh.10381607.0014.203  Hidayat, R., & Rahman, F. (2021). The role of self - control and gratitude in predicting happiness  among Muslim students.   Heliyon, 7 (12), e08674.  https://doi.org/10.1016/j.heliyon.2021.e08674\n\nBunga Alodia I . , Irianti Usman, Isman Rahmani Y . , Muhammad Fajar Siddiq R .  Psikoislamika: Jurnal Psikologi dan Psikologi Islam   158  Hills, P., & Argyle, M. (2002). The Oxford Happiness Questionnaire: A compact scale for the  measurement of psychological well - being.   Personality and Individual Differences, 33 (7),  1073 – 1082.   https://doi.org/10.1016/S0191 - 8869(01)00213 - 6  Karim, N., & Noor, M. (2019). Integrating Islamic spirituality into positive psychology: A review of  empirical evidence.   The International Journal for the Psychology of Religion, 29 (4), 293 – 308.  https://doi.org/10.1080/10508619.2019.1650432  Kline, R. B. (2016).   Principles and practice of structural equation modeling   (4th ed.). Guilford Press.  Lala, A., & Alwazzan, A. (2023). Happiness and perfection of the soul in Ibn Sina’s ethics.   Journal of  Islamic Ethics, 7 (1), 42 – 60.   https://doi.org/10.1163/24685542 - 12340092  Lawshe, C. H. (1975). A quantitative approach to content validity.   Personnel Psychology, 28 (4), 563 –  575.   https://doi.org/10.1111/j.1744 - 6570.1975.tb01393.x  Linacre, J. M. (2022).   A user’s guide to WINSTEPS Rasch - model computer programs.   Winsteps.com.  Nurhayati, R., & Sari, R. (2022). Exploring the multidimensional construct of happiness among  Indonesian Muslims.   Asian Journal of Social Psychology, 25 (1), 58 – 72.  https://doi.org/10.1111/ajsp.12485  Omais, S., & Dos Santos, R. (2022). Spirituality and well - being: A meta - analytic review.   Psychology of  Religion and Spirituality, 14 (4), 435 – 450.   https://doi.org/10.1037/rel0000451  Ryff, C. D. (1989). Happiness is everything, or is it? Explorations on the meaning of psychological  well - being.   Journal of Personality and Social Psychology, 57 (6), 1069 – 1081.  https://doi.org/10.1037/0022 - 3514.57.6.1069  Seligman, M. E. P. (2011).   Flourish: A visionary new understanding of happiness and well - being.   Free  Press.  Seligman, M. E. P., Steen, T. A., Park, N., & Peterson, C. (2004). Positive psychology progress:  Empirical validation of interventions.   American Psychologist, 60 (5), 410 – 421.  https://doi.org/10.1037/0003 - 066X.60.5.410  Shihab, M. Q. (2006).   Wawasan Al - Qur’an: Tafsir tematik atas pelbagai persoalan umat.   Mizan.  Sofia, F. N., & Sari, D. K. (2018). Dimensions of happiness in the Qur’an: A thematic interpretation  approach.   Indonesian Journal of Islamic Psychology, 2 (1), 12 – 25.  https://doi.org/10.21009/IJIP.2018.02.01.02  Tabachnick, B. G., & Fidell, L. S. (2003).   Using multivariate statistics   (5th ed.). Allyn & Bacon.  Tavakol, M., & Dennick, R. (2011). Making sense of Cronbach’s alpha.   International Journal of  Medical Education, 2 , 53 – 55.   https://doi.org/10.5116/ijme.4dfb.8dfd  Tugade, M. M., & Fredrickson, B. L. (2004). Resilient individuals use positive emotions to bounce  back from negative emotional experiences.   Journal of Personality and Social Psychology,  86 (2), 320 – 333.   https://doi.org/10.1037/0022 - 3514.86.2.320\n\nDevelopment of a happiness measurement scale based on the Quran and Hadith using the Rasch Model  Psikoislamika: Jurnal Psikologi dan Psikologi Islam   159  VanVoorhis, C. R., & Morgan, B. L. (2007). Understanding power and rules of thumb for determining  sample sizes.   Tutorials in Quantitative Methods for Psychology, 3 (2), 43 – 50.  https://doi.org/10.20982/tqmp.03.2.p043  Zhang, Y., & Chen, C. (2024). Cross - cultural validation of happiness measures using Rasch analysis.  Personality and Individual Differences, 222 , 112075.  https://doi.org/10.1016/j.paid.2023.112075",
    "warnings": [],
    "meta": {
      "pages": 9,
      "wordCount": 3847,
      "charCount": 27201
    }
  },
  "topology": {
    "nodes": [
      {
        "id": "n1",
        "label": "Mengukur bahagia sebagai akhlak",
        "meta": {
          "role": "spine"
        }
      },
      {
        "id": "n2",
        "label": "Menggugat sekularisme psikologi positif",
        "meta": {
          "role": "rib"
        }
      },
      {
        "id": "n3",
        "label": "Psikometri Rasch sebagai legitimasi",
        "meta": {
          "role": "rib"
        }
      },
      {
        "id": "n4",
        "label": "Aksioma universalitas dan risiko reduksi",
        "meta": {
          "role": "fiber"
        }
      }
    ],
    "links": [
      {
        "from": "n2",
        "to": "n1",
        "kind": "challenges",
        "weight": 0.78,
        "id": "n2->n1::challenges::0"
      },
      {
        "from": "n1",
        "to": "n3",
        "kind": "operationalizes",
        "weight": 0.86,
        "id": "n1->n3::operationalizes::0"
      },
      {
        "from": "n3",
        "to": "n1",
        "kind": "supports",
        "weight": 0.74,
        "id": "n3->n1::supports::0"
      },
      {
        "from": "n4",
        "to": "n1",
        "kind": "depends_on",
        "weight": 0.69,
        "id": "n4->n1::depends_on::0"
      },
      {
        "from": "n4",
        "to": "n3",
        "kind": "risks",
        "weight": 0.72,
        "id": "n4->n3::risks::0"
      }
    ],
    "springs": [
      {
        "a": "n1",
        "b": "n2",
        "restLen": 180.00000000000003,
        "stiffness": 0.78,
        "compliance": 0.01282051282051282,
        "contributors": [
          "n2->n1::challenges::0"
        ],
        "meta": {
          "policyParams": {
            "restLength": 180.00000000000003,
            "compliance": 0.01,
            "dampingScale": 1,
            "meta": {
              "edgeType": "challenges",
              "policyName": "default",
              "policyVersion": "1.0.0"
            }
          },
          "edgeType": "challenges",
          "dampingScale": 1,
          "allEdgeTypes": [
            "challenges"
          ]
        }
      },
      {
        "a": "n1",
        "b": "n3",
        "restLen": 180.00000000000003,
        "stiffness": 0.86,
        "compliance": 0.011627906976744186,
        "contributors": [
          "n1->n3::operationalizes::0",
          "n3->n1::supports::0"
        ],
        "meta": {
          "policyParams": {
            "restLength": 180.00000000000003,
            "compliance": 0.01,
            "dampingScale": 1,
            "meta": {
              "edgeType": "operationalizes",
              "policyName": "default",
              "policyVersion": "1.0.0"
            }
          },
          "edgeType": "operationalizes",
          "dampingScale": 1,
          "allEdgeTypes": [
            "operationalizes"
          ]
        }
      },
      {
        "a": "n1",
        "b": "n4",
        "restLen": 180.00000000000003,
        "stiffness": 0.69,
        "compliance": 0.014492753623188408,
        "contributors": [
          "n4->n1::depends_on::0"
        ],
        "meta": {
          "policyParams": {
            "restLength": 180.00000000000003,
            "compliance": 0.01,
            "dampingScale": 1,
            "meta": {
              "edgeType": "depends_on",
              "policyName": "default",
              "policyVersion": "1.0.0"
            }
          },
          "edgeType": "depends_on",
          "dampingScale": 1,
          "allEdgeTypes": [
            "depends_on"
          ]
        }
      },
      {
        "a": "n3",
        "b": "n4",
        "restLen": 180.00000000000003,
        "stiffness": 0.72,
        "compliance": 0.01388888888888889,
        "contributors": [
          "n4->n3::risks::0"
        ],
        "meta": {
          "policyParams": {
            "restLength": 180.00000000000003,
            "compliance": 0.01,
            "dampingScale": 1,
            "meta": {
              "edgeType": "risks",
              "policyName": "default",
              "policyVersion": "1.0.0"
            }
          },
          "edgeType": "risks",
          "dampingScale": 1,
          "allEdgeTypes": [
            "risks"
          ]
        }
      }
    ]
  },
  "layout": {
    "nodeWorld": {
      "n1": {
        "x": -120,
        "y": 0
      },
      "n2": {
        "x": 0,
        "y": -84
      },
      "n3": {
        "x": 0,
        "y": 84
      },
      "n4": {
        "x": 120,
        "y": 84
      }
    }
  },
  "camera": {
    "panX": 1.5,
    "panY": 0,
    "zoom": 1
  },
  "analysisMeta": {
    "version": 1,
    "nodesById": {
      "n1": {
        "sourceTitle": "Mengukur bahagia sebagai akhlak",
        "sourceSummary": "Teks ini mempertaruhkan tesis bahwa kebahagiaan dapat didefinisikan dan diukur sebagai capaian moral-spiritual yang berakar pada Al-Qur’an dan Hadis, bukan sekadar kondisi afektif subjektif. Kebahagiaan diposisikan sebagai hasil pembinaan diri yang terstruktur, yang terwujud melalui kesabaran, pengendalian diri, dan syukur. Penulis tidak hanya ingin menambah variasi instrumen, tetapi mengklaim adanya dimensi kebahagiaan yang kurang tertangkap oleh skala arus utama karena minimnya kerangka transendensi dan pertanggungjawaban ilahi. Klaim “universal” digunakan untuk menyatakan bahwa prinsip-prinsip tersebut melampaui batas agama dan budaya, sehingga dapat dipakai dalam riset lintas kelompok. Dengan demikian, kebahagiaan versi Islam dipresentasikan kompatibel dengan sains psikologi modern selama dapat dioperasionalisasikan secara ketat. Taruhannya adalah legitimasi ilmiah bagi konsep kebahagiaan yang normatif-etis, tanpa kehilangan standar psikometrik."
      },
      "n2": {
        "sourceTitle": "Menggugat sekularisme psikologi positif",
        "sourceSummary": "Lawan implisitnya adalah praktik pengukuran kebahagiaan yang dominan dalam psikologi positif yang cenderung sekuler dan individualistik, seperti PERMA dan dimensi kesejahteraan Ryff. Teks menilai model-model tersebut berguna tetapi tidak cukup karena kurang menempatkan spiritualitas transenden dan akuntabilitas moral sebagai unsur inti. Instrumen mapan seperti Oxford Happiness Questionnaire dan Satisfaction with Life Scale dijadikan contoh ekosistem ukur yang dianggap tidak mengintegrasikan sumber normatif Islam. Penulis juga menandai perbedaan metafisik sebagai sumber perbedaan konseptual: Barat menekankan appraisal kognitif dan pengalaman emosional, sedangkan Islam menekankan relasi manusia–Tuhan. Namun, penulis tidak memusuhi seluruh psikologi positif; ada strategi koalisi parsial dengan menonjolkan titik temu seperti regulasi diri dan syukur. Dengan cara ini, kritiknya diarahkan pada reduksionisme dan “kebutaan” terhadap dimensi moral-spiritual, bukan pada pengukuran kuantitatif itu sendiri."
      },
      "n3": {
        "sourceTitle": "Psikometri Rasch sebagai legitimasi",
        "sourceSummary": "Jembatan otoritasnya adalah penggunaan metodologi psikometri modern—CFA untuk struktur faktor dan Model Rasch untuk invarian pengukuran serta ketepatan butir. Penulis mengklaim kekuatan instrumen bukan hanya pada basis teks suci, tetapi pada bukti kesahihan yang terukur melalui indeks kecocokan model (CFI, TLI, RMSEA) dan reliabilitas komposit. Rasch dipakai sebagai “senjata” untuk menunjukkan item fit, konsistensi internal, dan daya pisah, sehingga konstruk yang normatif dapat tampil sebagai variabel ilmiah yang stabil. Strategi ini mengalihkan perdebatan dari “apakah konsep agama ilmiah” menjadi “apakah ia memenuhi kriteria pengukuran yang ketat dan invarian.” Sampel 450 partisipan dari beragam agama di Indonesia dipakai sebagai dukungan klaim lintas kelompok, walau detail pengujian invarian antaragama tidak dijelaskan dalam kutipan. Dengan demikian, kerangka kerja metodologis berfungsi sebagai penerjemah nilai Islam ke bahasa validitas, reliabilitas, dan generalisasi."
      },
      "n4": {
        "sourceTitle": "Aksioma universalitas dan risiko reduksi",
        "sourceSummary": "Argumen bergantung pada aksioma bahwa Al-Qur’an dan Hadis memuat prinsip kebahagiaan yang bersifat universal dan dapat diterapkan melampaui batas budaya serta agama, selaras dengan gagasan rahmatan lil ‘alamin. Ia juga mengasumsikan bahwa tiga konstruk—sabr, mujāhadah al-nafs, dan shukr—cukup representatif untuk merangkum kebahagiaan Islam, sehingga kompleksitas konsep seperti sa‘ādah, falah, dan al-salaam dapat dipetakan ke indikator yang terbatas. Asumsi lain adalah bahwa pengalaman religius dan moral dapat diperlakukan sebagai trait yang bisa diukur secara stabil, bukan semata praktik konteks atau keadaan situasional. Kekuatan hilirnya adalah terbukanya instrumen untuk riset lintas budaya, evaluasi intervensi berbasis etika Islam, dan pengaruh pada kebijakan kesejahteraan yang memasukkan dimensi spiritual-moral. Risiko hilirnya adalah penyempitan makna kebahagiaan menjadi skor psikometrik yang dapat mengabaikan kedalaman teologis, niat (niyyah), dan dimensi ibadah yang tidak mudah direduksi menjadi item. Ada pula risiko “universalisasi” yang menutupi perbedaan interpretasi intra-Islam maupun variasi penerimaan oleh non-Muslim, sehingga klaim lintas agama memerlukan kehati-hatian dalam pembacaan dan penggunaan. Dengan demikian, instrumen berdaya sebagai alat standardisasi, namun sekaligus berpotensi meratakan keragaman pengalaman spiritual dan etis."
      }
    }
  }
}